{"template":"__react_static_root__/src/components/QiitaPost","sharedHashesByProp":{},"data":{"post":{"rendered_body":"\n<h2>\n<span id=\"はじめに\" class=\"fragment\"></span><a href=\"#%E3%81%AF%E3%81%98%E3%82%81%E3%81%AB\"><i class=\"fa fa-link\"></i></a>はじめに</h2>\n\n<p>みなさんはスクラムガイド読んだことありますか？</p>\n\n<p><code>弊社はスクラム導入している</code> <code>アジャイルいいよね！</code> とかいう会話をしたことが一度でもある人は、<br>\nそんな長くないので原著スクラムガイドを読んでおくのはおすすめです。</p>\n\n<p><a href=\"https://scrumguides.org/docs/scrumguide/v2017/2017-Scrum-Guide-Japanese.pdf\" rel=\"nofollow noopener\" target=\"_blank\">PDF版</a>の文書を、クリエイティブ・コモンズ　<a href=\"https://creativecommons.org/licenses/by-sa/4.0/deed.ja\" rel=\"nofollow noopener\" target=\"_blank\">CC BY-SA 4.0</a>　のライセンス下で再配布しています。内容に変更はありません。<br>\n通勤中に何度も読んでいるときにPDFが大変だったなと思い、Webで見れるようにしたく書いてます。<br>\n(<a href=\"https://qiita.com/ykhirao/items/ed320eaecb876bfd189e\" id=\"reference-1c0d56d8870b27b1c787\">2020年版はこっち</a>)</p>\n\n<hr>\n\n<h1>\n<span id=\"スクラムガイド-2017\" class=\"fragment\"></span><a href=\"#%E3%82%B9%E3%82%AF%E3%83%A9%E3%83%A0%E3%82%AC%E3%82%A4%E3%83%89-2017\"><i class=\"fa fa-link\"></i></a>スクラムガイド™ 2017</h1>\n\n<h2>\n<span id=\"1-スクラムガイドの目的\" class=\"fragment\"></span><a href=\"#1-%E3%82%B9%E3%82%AF%E3%83%A9%E3%83%A0%E3%82%AC%E3%82%A4%E3%83%89%E3%81%AE%E7%9B%AE%E7%9A%84\"><i class=\"fa fa-link\"></i></a>1. スクラムガイドの目的</h2>\n\n<p>スクラムは、複雑なプロダクトを開発・提供・保守するためのフレームワークである。本ガイドでは、スクラムの定義を説明する。スクラムの定義に、スクラムの役割・イベント・作成物と、それらをまとめるルールが含まれる。スクラムは、Ken SchwaberとJeff Sutherlandが開発したものであり、スクラムガイドはこの 2 人が執筆・提供する。両者は共にスクラムガイドを支援している。</p>\n\n<h2>\n<span id=\"2-スクラムの定義\" class=\"fragment\"></span><a href=\"#2-%E3%82%B9%E3%82%AF%E3%83%A9%E3%83%A0%E3%81%AE%E5%AE%9A%E7%BE%A9\"><i class=\"fa fa-link\"></i></a>2. スクラムの定義</h2>\n\n<p>スクラム（名詞）：複雑で変化の激しい問題に対応するためのフレームワークであり、可能な限り価値の高いプロダクトを生産的かつ創造的に届けるためのものである。</p>\n\n<p>スクラムとは、以下のようなものである。</p>\n\n<ul>\n<li>軽量</li>\n<li>理解が容易</li>\n<li>習得は困難</li>\n</ul>\n\n<p>スクラムは、 1990 年代初頭から複雑なプロダクトの作業管理に使用されてきたプロセスフレームワークである。プロダクトを構築するプロセス、技法、決定的な方法論などではない。さまざまなプロセスや技法を取り入れることのできるフレームワークである。スクラムは、これまでのプロダクト管理や仕事のテクニックの相対的な有効性を明らかにして、プロダクト・チーム・作業環境の継続的な改善を可能にする。</p>\n\n<p>スクラムフレームワークは、スクラムチームとその役割・イベント・作成物・ルールで構成されている。それぞれに目的があり、スクラムの成功や利用に欠かせない。</p>\n\n<p>スクラムのルールは、役割・イベント・作成物をまとめ、それらの関係性や相互作用を統括するものである。スクラムのルールについては、本稿全体で説明する。</p>\n\n<p>スクラムフレームワークを使用する具体的な方法にはさまざまなものがあり、それらについては本稿では触れない。</p>\n\n<h2>\n<span id=\"3-スクラムの用途\" class=\"fragment\"></span><a href=\"#3-%E3%82%B9%E3%82%AF%E3%83%A9%E3%83%A0%E3%81%AE%E7%94%A8%E9%80%94\"><i class=\"fa fa-link\"></i></a>3. スクラムの用途</h2>\n\n<p>当初、スクラムはプロダクトの開発と管理のために開発された。 1990 年代初頭から使用され、今では以下のように世界中で広く利用されている。</p>\n\n<ol>\n<li>有望な市場・技術・プロダクトの研究および特定</li>\n<li>プロダクトや追加機能の開発</li>\n<li>プロダクトや追加機能のリリース（ 1 日に何度もリリースされる）</li>\n<li>プロダクトが使用するクラウド（オンライン、セキュア、オンデマンド）やその他運用環境の開発\nと保守</li>\n<li>プロダクトの保守や刷新</li>\n</ol>\n\n<p>スクラムは、ソフトウェア、ハードウェア、組込みソフトウェア、機能同士を接続するネットワーク、自動運転車などの開発から、学校、政府、マーケティング、組織運営マネジメントに至るまで、個人や社会が日常的に使用するあらゆるものに使用されている。</p>\n\n<p>技術・市場・環境の複雑化やそれらの相互作用は急速に高まっており、スクラムがその対応に有効であることは日々証明されている。</p>\n\n<p>スクラムは反復的で漸進的な知識移転において特に有効であることが示されている。今では、プロダクト、サービス、所属する組織の管理に広く利用されている。</p>\n\n<p>スクラムの本質は、少人数制のチームである。個々のチームは非常に柔軟で適応力に優れている。こうした強みは、単一のチームであっても、複数あるいは多数のチームであっても、数千人の成果やプロダクトを開発・リリース・運用・保守するネットワーク型のチームであっても有効である。チームは協力や情報交換をしながら、洗練された開発アーキテクチャやターゲットとするリリース環境を整えていく。</p>\n\n<p>スクラムガイドで「開発」や「開発する」といった言葉が登場するとき、それは上記のような複雑な作業を意味している。</p>\n\n<h2>\n<span id=\"4-スクラムの理論\" class=\"fragment\"></span><a href=\"#4-%E3%82%B9%E3%82%AF%E3%83%A9%E3%83%A0%E3%81%AE%E7%90%86%E8%AB%96\"><i class=\"fa fa-link\"></i></a>4. スクラムの理論</h2>\n\n<p>スクラムは、経験的プロセス制御の理論（経験主義）を基本にしている。経験主義とは、実際の経験と既知に基づく判断によって知識が獲得できるというものである。スクラムでは、反復的かつ漸進的な手法を用いて、予測可能性の最適化とリスクの管理を行う。</p>\n\n<p>経験的プロセス制御の実現は、透明性・検査・適応の 3 本柱に支えられている。</p>\n\n<h3>\n<span id=\"41-透明性\" class=\"fragment\"></span><a href=\"#41-%E9%80%8F%E6%98%8E%E6%80%A7\"><i class=\"fa fa-link\"></i></a>4.1 透明性</h3>\n\n<p>経験的プロセスで重要なのは、結果責任を持つ者に対して見える化されていることである。透明性とは、こうしたことが標準化され、見ている人が共通理解を持つことである。</p>\n\n<p>例：</p>\n\n<ul>\n<li>プロセスの用語を参加者全員で共有している。</li>\n<li>作業する人とそのインクリメントを検査する人が「完成」の定義を共有している。</li>\n</ul>\n\n<h3>\n<span id=\"42-検査\" class=\"fragment\"></span><a href=\"#42-%E6%A4%9C%E6%9F%BB\"><i class=\"fa fa-link\"></i></a>4.2 検査</h3>\n\n<p>スクラムのユーザーは、スクラムの作成物やスプリントゴールの進捗を頻繁に検査し、好ましくない変化を検知する。ただし、頻繁にやりすぎて作業の妨げになってはいけない。スキルの高い検査担当者が念入りに行えば、検査は最大の効果をもたらす。</p>\n\n<h3>\n<span id=\"43-適応\" class=\"fragment\"></span><a href=\"#43-%E9%81%A9%E5%BF%9C\"><i class=\"fa fa-link\"></i></a>4.3 適応</h3>\n\n<p>プロセスの不備が許容値を超え、成果となるプロダクトを受け入れられないと検査担当者が判断した場合は、プロセスやその構成要素を調整する必要がある。調整はできるだけ早く行い、これ以上の逸脱を防がなければいけない。</p>\n\n<p>スクラムでは、検査と適応のための 4 つの公式なイベントを規定している。詳しくは、「スクラムイベント」の節で説明する。</p>\n\n<ul>\n<li>スプリントプランニング</li>\n<li>デイリースクラム</li>\n<li>スプリントレビュー</li>\n<li>スプリントレトロスペクティブ</li>\n</ul>\n\n<h2>\n<span id=\"5-スクラムの価値基準\" class=\"fragment\"></span><a href=\"#5-%E3%82%B9%E3%82%AF%E3%83%A9%E3%83%A0%E3%81%AE%E4%BE%A1%E5%80%A4%E5%9F%BA%E6%BA%96\"><i class=\"fa fa-link\"></i></a>5. スクラムの価値基準</h2>\n\n<p>スクラムチームが、確約（commitment）・勇気（courage）・集中（focus）・公開（openness）・尊敬（respect）の価値基準を取り入れ、それらを実践するとき、スクラムの柱（透明性・検査・適応）は現実のものとなり、あらゆる人に対する信頼が築かれる。スクラムチームのメンバーは、スクラムの役割・イベント・作成物に触れて仕事を進めるなかで、これらの価値基準を学習・探索する。</p>\n\n<p>スクラムを活用するには、これらの 5 つの価値基準を上手に実践しなければいけない。個人は、スクラムチームのゴールの達成を確約しなければいけない。スクラムチームのメンバーは、正しいことをする勇気を持ち、困難な問題に取り組まなければいけない。全員が、スプリントの作業とスクラムチームのゴールに集中しなければいけない。スクラムチームとステークホルダーは、すべての仕事とそれらを遂行する上での課題を公開することに合意しなければいけない。スクラムチームのメンバーは、お互いを能力のある独立した個人として尊敬しなければいけない。</p>\n\n<h2>\n<span id=\"6-スクラムチーム\" class=\"fragment\"></span><a href=\"#6-%E3%82%B9%E3%82%AF%E3%83%A9%E3%83%A0%E3%83%81%E3%83%BC%E3%83%A0\"><i class=\"fa fa-link\"></i></a>6. スクラムチーム</h2>\n\n<p>スクラムチームは、プロダクトオーナー・開発チーム・スクラムマスターで構成される。スクラムチームは自己組織化されており、機能横断的である。自己組織化チームは、作業を成し遂げるための最善の策を、チーム外からの指示ではなく、自分たちで選択する。機能横断的チームは、チーム以外に頼らずに作業を成し遂げる能力を持っている。スクラムにおけるチームのモデルは、柔軟性・創造性・生産性を最適化するように設計されている。スクラムチームは、前述した用途や複雑な仕事において、非常に高い効果を自ら証明している。スクラムチームは、プロダクトを反復的・漸進的に届ける。これは、フィードバックの機会を最大化するためである。「完成」したプロダクトを漸進的に届けることで、動作するプロダクトで役に立つ可能性のあるバージョンを常に利用可能にする。</p>\n\n<h3>\n<span id=\"61-プロダクトオーナー\" class=\"fragment\"></span><a href=\"#61-%E3%83%97%E3%83%AD%E3%83%80%E3%82%AF%E3%83%88%E3%82%AA%E3%83%BC%E3%83%8A%E3%83%BC\"><i class=\"fa fa-link\"></i></a>6.1 プロダクトオーナー</h3>\n\n<p>プロダクトオーナーは、開発チームから生み出されるプロダクトの価値の最大化に責任を持つ。組織・スクラムチーム・個人によって、その方法はさまざまである。プロダクトオーナーは、プロダクトバックログの管理に責任を持つ 1 人の人間である。プロダクトバックログの管理には、以下のようなものがある。</p>\n\n<ul>\n<li>プロダクトバックログアイテムを明確に表現する。</li>\n<li>ゴールとミッションを達成できるようにプロダクトバックログアイテムを並び替える。</li>\n<li>開発チームが行う作業の価値を最適化する。</li>\n<li>プロダクトバックログを全員に見える化・透明化・明確化し、スクラムチームが次に行う作業を示す。</li>\n<li>必要とされるレベルでプロダクトバックログアイテムを開発チームに理解してもらう。</li>\n</ul>\n\n<p>上記の作業は、プロダクトオーナーが行う場合もあれば、開発チームが行う場合もある。いずれの場合も、最終的な責任はプロダクトオーナーが持つ。</p>\n\n<p>プロダクトオーナーは 1 人の人間であり、委員会ではない。委員会の要求をプロダクトバックログに反映することもあるだろうが、プロダクトバックログアイテムの優先順位の変更については、プロダクトオーナーと相談しなければいけない。</p>\n\n<p>プロダクトオーナーをうまく機能させるには、組織全体でプロダクトオーナーの決定を尊重しなければいけない。プロダクトオーナーの決定は、プロダクトバックログの内容や並び順という形で見える化されている。異なる要求の作業を開発チームに強制することは誰にもできない。</p>\n\n<h3>\n<span id=\"62-開発チーム\" class=\"fragment\"></span><a href=\"#62-%E9%96%8B%E7%99%BA%E3%83%81%E3%83%BC%E3%83%A0\"><i class=\"fa fa-link\"></i></a>6.2 開発チーム</h3>\n\n<p>開発チームは、各スプリントの終了時にリリース判断可能な「完成」したプロダクトインクリメントを届けることのできる専門家で構成されている。「完成」したインクリメントは、スプリントレビューに必要である。インクリメントを作成できるのは、開発チームのメンバーだけである。</p>\n\n<p>開発チームは、自分たちの作業を構成・管理するために、組織から体制と権限を与えられている。その相乗効果によって、開発チーム全体の効率と効果が最適化される。</p>\n\n<p>開発チームには、以下のような特徴がある。</p>\n\n<ul>\n<li>自己組織化されている。プロダクトバックログをリリース判断可能な機能のインクリメントに変える方法は、誰も（スクラムマスターでさえも）教えてくれない。</li>\n<li>機能横断的である。インクリメントを作成するスキルをチームとしてすべて備えている。</li>\n<li>ある人にしかできない作業があったとしても、スクラムにおける開発チームのメンバーに肩書きはない。</li>\n<li>テスティング、アーキテクチャ、運用、ビジネス分析のような専門領域であっても、スクラムは開発チームのサブチームを認めていない。</li>\n<li>開発チームのメンバーに専門能力や専門分野があったとしても、最終的な責任は開発チーム全体が持つ。</li>\n</ul>\n\n<h4>\n<span id=\"621-開発チームの規模\" class=\"fragment\"></span><a href=\"#621-%E9%96%8B%E7%99%BA%E3%83%81%E3%83%BC%E3%83%A0%E3%81%AE%E8%A6%8F%E6%A8%A1\"><i class=\"fa fa-link\"></i></a>6.2.1 開発チームの規模</h4>\n\n<p>開発チームに最適な人数は、小回りが利く程度に少なく、 1 つのスプリントで重要な作業が成し遂げられる程度に多い人数である。開発チームのメンバーが 3 人未満の場合は、相互作用が少なく、生産性の向上につながらない。また、開発チームの規模が小さいと、スキル不足が原因でリリース判断可能なインクリメントを届けられない可能性もある。メンバーが 9 人を超えた場合は、調整の機会が多くなってしまう。また、チームの規模が大きいと経験的プロセスが複雑になり、有益ではなくなる。スプリントバックログの作業に携わらないのであれば、プロダクトオーナーとスクラムマスターはこの人数に含まない。</p>\n\n<h3>\n<span id=\"63-スクラムマスター\" class=\"fragment\"></span><a href=\"#63-%E3%82%B9%E3%82%AF%E3%83%A9%E3%83%A0%E3%83%9E%E3%82%B9%E3%82%BF%E3%83%BC\"><i class=\"fa fa-link\"></i></a>6.3 スクラムマスター</h3>\n\n<p>スクラムマスターは、スクラムガイドで定義されたスクラムの促進と支援に責任を持つ。スクラムマスターは、スクラムの理論・プラクティス・ルール・価値基準を全員に理解してもらえるように支援することで、その責任を果たす。</p>\n\n<p>スクラムマスターは、スクラムチームのサーバントリーダーである（訳注：メンバーが成果を上げるために支援や奉仕をするリーダーのこと）。 スクラムマスターは、スクラムチームとやり取りをするときに役に立つこと／立たないことをスクラムチームの外部の人たちに理解してもらう。スクラムマスターは、こうしたやり取りに変化をもたらすことで、スクラムチームの作る価値を最大化する。</p>\n\n<h4>\n<span id=\"631-スクラムマスターはプロダクトオーナーを支援する\" class=\"fragment\"></span><a href=\"#631-%E3%82%B9%E3%82%AF%E3%83%A9%E3%83%A0%E3%83%9E%E3%82%B9%E3%82%BF%E3%83%BC%E3%81%AF%E3%83%97%E3%83%AD%E3%83%80%E3%82%AF%E3%83%88%E3%82%AA%E3%83%BC%E3%83%8A%E3%83%BC%E3%82%92%E6%94%AF%E6%8F%B4%E3%81%99%E3%82%8B\"><i class=\"fa fa-link\"></i></a>6.3.1 スクラムマスターはプロダクトオーナーを支援する</h4>\n\n<p>スクラムマスターは、さまざまな形でプロダクトオーナーを支援する。</p>\n\n<ul>\n<li>スクラムチームの全員がゴール、スコープ、プロダクトのドメインを可能な限り理解できるようにする。</li>\n<li>効果的なプロダクトバックログの管理方法を探す。</li>\n<li>明確で簡潔なプロダクトバックログアイテムの必要性についてスクラムチームに理解してもらう。</li>\n<li>経験主義におけるプロダクトプランニングについて理解する。</li>\n<li>価値を最大化するためのプロダクトバックログの調整方法をプロダクトオーナーに把握してもらう。</li>\n<li>アジャイルを理解・実践している。</li>\n<li>必要に応じてスクラムイベントをファシリテートする。</li>\n</ul>\n\n<h4>\n<span id=\"632-スクラムマスターは開発チームを支援する\" class=\"fragment\"></span><a href=\"#632-%E3%82%B9%E3%82%AF%E3%83%A9%E3%83%A0%E3%83%9E%E3%82%B9%E3%82%BF%E3%83%BC%E3%81%AF%E9%96%8B%E7%99%BA%E3%83%81%E3%83%BC%E3%83%A0%E3%82%92%E6%94%AF%E6%8F%B4%E3%81%99%E3%82%8B\"><i class=\"fa fa-link\"></i></a>6.3.2 スクラムマスターは開発チームを支援する</h4>\n\n<p>スクラムマスターは、さまざまな形で開発チームを支援する。</p>\n\n<ul>\n<li>自己組織化・機能横断的な開発チームをコーチする。</li>\n<li>開発チームが価値の高いプロダクトを作れるように支援する。</li>\n<li>開発チームの進捗を妨げるものを排除する。</li>\n<li>必要に応じてスクラムイベントをファシリテートする。</li>\n<li>スクラムがまだ完全に適用・理解されていない組織環境で、開発チームをコーチする。</li>\n</ul>\n\n<h4>\n<span id=\"633-スクラムマスターは組織を支援する\" class=\"fragment\"></span><a href=\"#633-%E3%82%B9%E3%82%AF%E3%83%A9%E3%83%A0%E3%83%9E%E3%82%B9%E3%82%BF%E3%83%BC%E3%81%AF%E7%B5%84%E7%B9%94%E3%82%92%E6%94%AF%E6%8F%B4%E3%81%99%E3%82%8B\"><i class=\"fa fa-link\"></i></a>6.3.3 スクラムマスターは組織を支援する</h4>\n\n<p>スクラムマスターは、さまざまな形で組織を支援する。</p>\n\n<ul>\n<li>組織へのスクラムの導入を指導・コーチする。</li>\n<li>組織へのスクラムの導入方法を計画する。</li>\n<li>スクラムや経験的プロダクト開発を社員やステークホルダーに理解・実施してもらう。</li>\n<li>スクラムチームの生産性を高めるような変化を促す。</li>\n<li>他のスクラムマスターと一緒に組織におけるスクラム導入の効果を高める。</li>\n</ul>\n\n<h2>\n<span id=\"7-スクラムイベント\" class=\"fragment\"></span><a href=\"#7-%E3%82%B9%E3%82%AF%E3%83%A9%E3%83%A0%E3%82%A4%E3%83%99%E3%83%B3%E3%83%88\"><i class=\"fa fa-link\"></i></a>7. スクラムイベント</h2>\n\n<p>スクラムで規定されたイベントは規則性を作り出し、スクラムで定義されていないミーティングの必要性を最小化する。すべてのイベントは、時間に上限のあるタイムボックス化されたイベントである。スプリントを開始すると、その期間は固定され、増減することはできない。スプリント以外のイベントについては、目的が達成されたときに終了することもある。これは、プロセスでムダなことをせずに、必要な分だけ時間を使うためである。</p>\n\n<p>スプリント以外のスクラムイベントは、何かを検査・適応するための公式な機会である（スプリントはその他のイベントの入れ物である）。これらのイベントは、非常に重要な透明性と検査の両方が実現できるように設計されている。これらのイベントがなければ、透明性は低下し、検査・適応の多くの機会を失う。</p>\n\n<h3>\n<span id=\"71-スプリント\" class=\"fragment\"></span><a href=\"#71-%E3%82%B9%E3%83%97%E3%83%AA%E3%83%B3%E3%83%88\"><i class=\"fa fa-link\"></i></a>7.1 スプリント</h3>\n\n<p>スクラムの中心はスプリントである。これは、「完成」した、利用可能な、リリース判断可能なプロダクトインクリメントを作るための、 1 か月以下のタイムボックスである。開発中はスプリントの長さは常に一定である。スプリントが終了すると、すぐに新しいスプリントが開始される。</p>\n\n<p>スプリントは、スプリントプランニング・デイリースクラム・開発作業・スプリントレビュー・スプリントレトロスペクティブで構成される。</p>\n\n<p>スプリントでは、</p>\n\n<ul>\n<li>スプリントゴールに悪影響を及ぼすような変更を加えない。</li>\n<li>品質目標を下げない。</li>\n<li>学習が進むにつれてスコープが明確化され、プロダクトオーナーと開発チームの交渉が必要になる可能性がある。</li>\n</ul>\n\n<p>スプリントは 1 か月以内のプロジェクトと考えることができる。プロジェクトと同様に、スプリントは何かを成し遂げるために使うものである。スプリントには、開発対象のゴール、開発のための設計や柔軟な計画、実際の作業、成果となるプロダクトインクリメントが含まれる。</p>\n\n<p>スプリントの期間は 1 か月以内に制限されている。スプリントが長すぎると、開発対象の定義が変更されたり、複雑になったり、リスクが増大したりする可能性がある。ゴールに対する進捗を少なくとも 1 か月ごとに検査・適応することで、予測可能性が高まるのである。また、リスクも 1 か月分のコストに収まるようになる。</p>\n\n<h4>\n<span id=\"711-スプリントの中止\" class=\"fragment\"></span><a href=\"#711-%E3%82%B9%E3%83%97%E3%83%AA%E3%83%B3%E3%83%88%E3%81%AE%E4%B8%AD%E6%AD%A2\"><i class=\"fa fa-link\"></i></a>7.1.1 スプリントの中止</h4>\n\n<p>スプリントはタイムボックスの終了前に中止できる。スプリントを中止する権限があるのは、プロダクトオーナーだけである。このときに、ステークホルダー・開発チーム・スクラムマスターの意見を参考にすることもできる。</p>\n\n<p>スプリントゴールが古くなった場合は、スプリントを中止することになるだろう。会社の方向性や市場・技術の状況が変化すると、スプリントゴールは古くなってしまう。状況を考慮して意味がなくなったと思えば、スプリントを中止すべきである。ただし、スプリントの期間は短いので、中止したからといって影響があることはほとんどない。</p>\n\n<p>スプリントを中止した場合は、プロダクトバックログの「完成」したアイテムをレビューする。部分的にリリース判断可能なものについては、通常はプロダクトオーナーが受け入れる。未完成のプロダクトバックログアイテムは、再見積りをしてからプロダクトバックログに戻す。そこにかかった作業の価値は急速に低下するため、頻繁に再見積りが必要になる（訳注：作りかけの機能や設計については、時間が経つと状況が変わってしまうため、その価値が失われてしまうことが多い。そうすると、最初から見積りをやり直す必要が出てくる）。</p>\n\n<p>スプリントを中止すると、新しいスプリントのスプリントプランニングのために全員が再度集まる必要があり、リソースを消費してしまう。また、スプリントの中止がチームのトラウマになってしまうこともある。とはいえ、スプリントの中止はめったに発生しない。</p>\n\n<h3>\n<span id=\"72-スプリントプランニング\" class=\"fragment\"></span><a href=\"#72-%E3%82%B9%E3%83%97%E3%83%AA%E3%83%B3%E3%83%88%E3%83%97%E3%83%A9%E3%83%B3%E3%83%8B%E3%83%B3%E3%82%B0\"><i class=\"fa fa-link\"></i></a>7.2 スプリントプランニング</h3>\n\n<p>スプリントの作業はスプリントプランニングで計画する。これはスクラムチームの共同作業である。</p>\n\n<p>スプリントが 1 か月の場合、スプリントプランニングのタイムボックスは最大で 8 時間である。スプリントの期間が短ければ、スプリントプランニングの時間も短くすることが多い。スクラムマスターは、参加者に目的を理解してもらうようにする。スクラムマスターは、スクラムチームにタイムボックスを守るように伝える。</p>\n\n<p>スプリントプランニングでは、以下の質問に答える。</p>\n\n<ul>\n<li>スプリントの成果であるインクリメントで何を届けることができるか？</li>\n<li>インクリメントを届けるために必要な作業をどのように成し遂げるか？</li>\n</ul>\n\n<h5>\n<span id=\"トピック-1-スプリントで何ができるか\" class=\"fragment\"></span><a href=\"#%E3%83%88%E3%83%94%E3%83%83%E3%82%AF-1-%E3%82%B9%E3%83%97%E3%83%AA%E3%83%B3%E3%83%88%E3%81%A7%E4%BD%95%E3%81%8C%E3%81%A7%E3%81%8D%E3%82%8B%E3%81%8B\"><i class=\"fa fa-link\"></i></a>トピック 1 ：スプリントで何ができるか？</h5>\n\n<p>開発チームは、スプリントで開発できそうな機能を予想する。プロダクトオーナーは、スプリントで達成すべき目的と、完成すればスプリントゴールを達成できそうなプロダクトバックログアイテムについて検討する。スクラムチームはみんなで協力して、スプリントの作業を理解する。</p>\n\n<p>スプリントプランニングのインプットは、プロダクトバックログ、最新のプロダクトインクリメント、開発チームが予想するキャパシティと過去の実績である。プロダクトバックログから選択するアイテム数については、開発チームが責任を持つ。スプリントで何を達成するかを評価できるのは、開発チームだけである。</p>\n\n<p>スプリントプランニングでは、スクラムチームがスプリントゴールを設定する。スプリントゴールとは、プロダクトバックログを実装することで実現するスプリントの目的であり、開発チームがインクリメントを開発する指針となるものである。</p>\n\n<h5>\n<span id=\"トピック-2-選択した作業をどのように成し遂げるか\" class=\"fragment\"></span><a href=\"#%E3%83%88%E3%83%94%E3%83%83%E3%82%AF-2-%E9%81%B8%E6%8A%9E%E3%81%97%E3%81%9F%E4%BD%9C%E6%A5%AD%E3%82%92%E3%81%A9%E3%81%AE%E3%82%88%E3%81%86%E3%81%AB%E6%88%90%E3%81%97%E9%81%82%E3%81%92%E3%82%8B%E3%81%8B\"><i class=\"fa fa-link\"></i></a>トピック 2 ：選択した作業をどのように成し遂げるか？</h5>\n\n<p>プロダクトバックログアイテムを選択し、スプリントゴールを設定したら、開発チームはスプリントでそれらの機能を「完成」したプロダクトインクリメントにする方法を決める。選択したプロダクトバックログアイテムとそれらを届ける計画を合わせて、スプリントバックログと呼ぶ。</p>\n\n<p>開発チームは、プロダクトバックログを動作するプロダクトインクリメントに変えるために必要なシステムと作業の設計から着手する。作業の規模や工数はバラバラであっても構わないが、開発チームが次のスプリントで実現できそうなものを計画する。開発チームがスプリントの最初の数日間で行う作業については、スプリントプランニングで作業に分解する。作業の単位は 1 日以下にすることが多い。開発チームは自己組織化して、スプリントバックログの作業を引き受ける。これはスプリントプランニングだけでなく、必要であればスプリントでも行う。</p>\n\n<p>プロダクトオーナーは、選択したプロダクトバックログアイテムの明確化やトレードオフを支援する。開発チームの作業が多すぎたり少なすぎたりした場合は、選択されたプロダクトバックログアイテムについて、開発チームとプロダクトオーナーで話し合う。あるいは、技術やドメインに詳しい人を招待してアドバイスを求めることもできる。</p>\n\n<p>スプリントプランニングが終了するまでに、開発チームは自己組織化したチームとして、どのようにスプリントゴールを達成し、どのように期待されるインクリメントを作成するかをプロダクトオーナーとスクラムマスターに説明できなければいけない。</p>\n\n<h4>\n<span id=\"721-スプリントゴール\" class=\"fragment\"></span><a href=\"#721-%E3%82%B9%E3%83%97%E3%83%AA%E3%83%B3%E3%83%88%E3%82%B4%E3%83%BC%E3%83%AB\"><i class=\"fa fa-link\"></i></a>7.2.1 スプリントゴール</h4>\n\n<p>スプリントゴールはスプリントの目的の集合であり、プロダクトバックログの実装によって実現するものである。これは開発チームがインクリメントを構築する理由を知る指針となる。スプリントゴールはスプリントプランニングで作成する。スプリントゴールを設定することで、開発チームがスプリント終了までに実装する機能を柔軟にできる。選択したプロダクトバックログアイテムは、一貫性のある機能として届けられる。それがスプリントゴールになることもある。スプリントゴールがあれば、開発チームは一致団結して作業ができる。</p>\n\n<p>開発チームが作業するときには、スプリントゴールを念頭に置く。スプリントゴールを達成するために、機能や技術を実装する。開発チームの予想と異なることが判明した場合は、プロダクトオーナーと交渉してスプリントバックログのスコープを調整する。</p>\n\n<h3>\n<span id=\"73-デイリースクラム\" class=\"fragment\"></span><a href=\"#73-%E3%83%87%E3%82%A4%E3%83%AA%E3%83%BC%E3%82%B9%E3%82%AF%E3%83%A9%E3%83%A0\"><i class=\"fa fa-link\"></i></a>7.3 デイリースクラム</h3>\n\n<p>デイリースクラムとは、開発チームのための 15 分間のタイムボックスのイベントである。スプリントでは、毎日デイリースクラムを開催する。開発チームは、次の 24 時間の作業を計画する。前回のデイリースクラムから行なった作業の検査と今後のスプリント作業の予想をすることで、チームのコラボレーションやパフォーマンスを最適化するのである。デイリースクラムは毎日、同じ時間・場所で開催し、複雑にならないようにする。</p>\n\n<p>開発チームはデイリースクラムを使って、スプリントゴールとスプリントバックログの進捗を検査する。デイリースクラムは、開発チームがスプリントゴールを達成する可能性を最適化する。開発チームは、自己組織化チームとしてスプリントゴールを達成し、スプリント終了までに期待されるインクリメントを作成できるかを毎日把握しなければいけない。</p>\n\n<p>デイリースクラムの構成は、開発チームが設定する。スプリントゴールを目指している限り、他のやり方で行なっても構わない。質問を使うチームもあれば、議論ベースで進めるチームもある。たとえば、以下のような例を使用するといいだろう。</p>\n\n<ul>\n<li>開発チームがスプリントゴールを達成するために、私が昨日やったことは何か？</li>\n<li>開発チームがスプリントゴールを達成するために、私が今日やることは何か？</li>\n<li>私や開発チームがスプリントゴールを達成する上で、障害となる物を目撃したか？</li>\n</ul>\n\n<p>開発チームやチームメンバーは、デイリースクラムの終了直後に集まり、スプリントの残作業について、詳細な議論・適応・再計画を行うこともある。</p>\n\n<p>スクラムマスターは、開発チームにデイリースクラムを開催してもらうようにする。ただし、デイリースクラムを開催する責任は開発チームにある。スクラムマスターは、デイリースクラムを 15 分間のタイムボックスで終わらせるように開発チームに伝える。</p>\n\n<p>デイリースクラムは開発チームのためのミーティングである。それ以外の人たちが参加する場合、開発チームの邪魔にならないようにスクラムマスターが配慮する。</p>\n\n<p>デイリースクラムは、コミュニケーションを改善し、その他のミーティングを取り除き、開発の障害物を特定・排除し、迅速な意思決定を強調・助長して、開発チームのプロジェクト知識のレベルを向上させるものである。これは、検査と適応の重要なイベントである。</p>\n\n<h3>\n<span id=\"74-スプリントレビュー\" class=\"fragment\"></span><a href=\"#74-%E3%82%B9%E3%83%97%E3%83%AA%E3%83%B3%E3%83%88%E3%83%AC%E3%83%93%E3%83%A5%E3%83%BC\"><i class=\"fa fa-link\"></i></a>7.4 スプリントレビュー</h3>\n\n<p>スプリントレビューとは、スプリントの終了時にインクリメントの検査と、必要であればプロダクトバックログの適応を行うものである。スプリントレビューでは、スクラムチームとステークホルダーがスプリントの成果をレビューする。スプリントの成果とプロダクトバックログの変更を参考にして、価値を最適化するために次に何ができるかを参加者全員で話し合う。これはステータスミーティングではなく、略式のミーティングである。インクリメントを提示することで、フィードバックや協力を引き出すことを目的とする。</p>\n\n<p>スプリントが 1 か月の場合、スプリントレビューは最大 4 時間である。スプリントの期間が短ければ、スプリントレビューの時間も短くすることが多い。スクラムマスターはスプリントレビューが確実に開催されるようにして、参加者には目的を理解してもらうようにする。スクラムマスターは関係者全員にタイムボックスを守るように伝える。</p>\n\n<p>スプリントレビューには、以下の要素が含まれる。</p>\n\n<ul>\n<li>参加者は、スクラムチームと、プロダクトオーナーが招待した重要なステークホルダーである。</li>\n<li>プロダクトオーナーは、プロダクトバックログアイテムの「完成」したものと「完成」していないものについて説明する。</li>\n<li>開発チームは、スプリントでうまくいったこと、直面した問題点、それをどのように解決したかを議論する。</li>\n<li>開発チームは、「完成」したものをデモして、インクリメントに対する質問に答える。「完成」の定義にプロダクト機能のリリースが含まれていれば、それらを表示してレビューしてもらう。</li>\n<li>プロダクトオーナーは、現在のプロダクトバックログの状況を説明する。（必要であれば）現在の進捗から、可能性のある目標とデリバリーの日程を予測する。</li>\n<li>グループ全体で次に何をするべきかを議論し、次のスプリントプランニングに価値のあるインプットを提供できるようにする。</li>\n<li>市場やプロダクトの利用状況によって、次に行うべき最も価値の高いことが変更される可能性をレビューする。</li>\n<li>次にリリースするプロダクトの機能や性能のスケジュール・予算・可能性・市場をレビューする。</li>\n</ul>\n\n<p>スプリントレビューの成果は、次のスプリントで使用するプロダクトバックログアイテムが含まれた改訂版のプロダクトバックログである。新たな機会に見合うように、プロダクトバックログを全体的に調整することもある。</p>\n\n<h3>\n<span id=\"75-スプリントレトロスペクティブ\" class=\"fragment\"></span><a href=\"#75-%E3%82%B9%E3%83%97%E3%83%AA%E3%83%B3%E3%83%88%E3%83%AC%E3%83%88%E3%83%AD%E3%82%B9%E3%83%9A%E3%82%AF%E3%83%86%E3%82%A3%E3%83%96\"><i class=\"fa fa-link\"></i></a>7.5 スプリントレトロスペクティブ</h3>\n\n<p>スプリントレトロスペクティブは、スクラムチームの検査と次のスプリントの改善計画を作成する機会である。</p>\n\n<p>スプリントレトロスペクティブは、スプリントレビューが終わって、次のスプリントプランニングが始まる前に行う。スプリントが 1 か月の場合、スプリントレトロスペクティブは最大 3 時間である。スプリントの期間が短ければ、スプリントレトロスペクティブの時間も短くすることが多い。スクラムマスターは、このイベントが確実に開催されるようにする。また、参加者に目的を理解してもらうようにする。</p>\n\n<p>スクラムマスターは、このミーティングがポジティブで生産的になるようにする。スクラムマスターは、全員にタイムボックスを守るように伝える。スクラムマスターは、スクラムのプロセスを説明するために、チームメンバーとして参加する。</p>\n\n<p>スプリントレトロスペクティブには、以下の目的がある。</p>\n\n<ul>\n<li>人・関係・プロセス・ツールの観点から今回のスプリントを検査する。</li>\n<li>うまくいった項目や今後の改善が必要な項目を特定・整理する。</li>\n<li>スクラムチームの作業の改善実施計画を作成する。</li>\n</ul>\n\n<p>スクラムマスターは、次のスプリントが効果的で楽しいものになるように、スクラムチームにスクラムプロセスフレームワークの範囲内で開発プロセスやプラクティスを改善してもらう。スプリントレトロスペクティブにおいてスクラムチームは、作業プロセスの改善や「完成」の定義を調整することにより、プロダクトの品質を向上させる方法を計画する。ただし、プロダクトや組織の基準と衝突しないように適切に行う。</p>\n\n<p>スプリントレトロスペクティブが終わるまでに、スクラムチームは次のスプリントで実施する改善策を特定しなければいけない。これらの改善策の実施は、スクラムチーム自体の検査に対する適応になる。改善はいつでも実施可能だが、スプリントレトロスペクティブは検査と適応に集中するための公式な機会である。</p>\n\n<h2>\n<span id=\"8-スクラムの作成物\" class=\"fragment\"></span><a href=\"#8-%E3%82%B9%E3%82%AF%E3%83%A9%E3%83%A0%E3%81%AE%E4%BD%9C%E6%88%90%E7%89%A9\"><i class=\"fa fa-link\"></i></a>8. スクラムの作成物</h2>\n\n<p>スクラムの作成物は、作業や価値を表したものであり、透明性や検査・適応の機会を提供するものである。スクラムで定義された作成物は、全員が共通理解を得るために必要な情報の透明性を最大化するように設計されている。</p>\n\n<h3>\n<span id=\"81-プロダクトバックログ\" class=\"fragment\"></span><a href=\"#81-%E3%83%97%E3%83%AD%E3%83%80%E3%82%AF%E3%83%88%E3%83%90%E3%83%83%E3%82%AF%E3%83%AD%E3%82%B0\"><i class=\"fa fa-link\"></i></a>8.1 プロダクトバックログ</h3>\n\n<p>プロダクトバックログは、プロダクトに必要だと把握しているものをすべて順番に並べた一覧である。プロダクトに対する変更要求の唯一の情報源である。プロダクトオーナーは、プロダクトバックログの内容・可用性・並び順に責任を持つ。</p>\n\n<p>プロダクトバックログは決して完成しない。構築の初期段階には、明確でよく理解できている要求が並べられている。その後、プロダクトや使用環境に合わせて進化する。プロダクトバックログは動的であり、適切で競争力のある有用なプロダクトに必要なものを求めて絶えず変化する。プロダクトが存在する限り、プロダクトバックログも存在し続けるのである。</p>\n\n<p>プロダクトバックログは、今後のリリースで実装するプロダクトのフィーチャ・機能・要求・要望・修正をすべて一覧にしている。プロダクトバックログアイテムには、詳細・並び順・見積り・価値の属性がある。プロダクトバックログアイテムには、「完成」時にそれを確認するためのテスト記述も含まれていることが多い。</p>\n\n<p>プロダクトが使用されて価値が増加し、市場からフィードバックを得られると、プロダクトバックログは巨大で包括的な一覧になる。要求の変更は止まらない。プロダクトバックログは生きた作成物である。ビジネス要求、市場の状態、技術の変化などが、プロダクトバックログの変化につながる。</p>\n\n<p>複数のスクラムチームが同じプロダクトの作業をすることがよくある。そうした場合、プロダクトの作業は 1 つのプロダクトバックログに記述する。また、アイテムを分類するための属性をプロダクトバックログに追加することもある。</p>\n\n<p>プロダクトバックログに含まれるアイテムに対して、詳細の追加、見積り、並び替えをすることを、プロダクトバックログのリファインメントと呼ぶ。これはプロダクトオーナーと開発チームが協力して行う継続的なプロセスである。プロダクトバックログのリファインメントによって、アイテムのレビューと改訂が行われる。いつどのようにリファインメントをするかは、スクラムチームが決定する。リファインメントは、開発チームの作業の10%以下にすることが多い。ただし、プロダクトバックログアイテムはプロダクトオーナーの判断によって、いつでも更新できる。</p>\n\n<p>並び順が上のプロダクトバックログアイテムほど明確で詳細である。明確で詳細であれば、見積りも正確になる。並び順が下のアイテムほど不正確で詳細ではない。今後のスプリントで開発チームが従事するプロダクトバックログアイテムは、スプリントのタイムボックスで「完成」できるようにうまく細分化する。開発チームが 1 つのスプリントで「完成」できそうなプロダクトバックログアイテムは、スプリントプランニングで選択できる「準備完了（Ready）」の状態になったと見なすことができる。プロダクトバックログアイテムは、上記のリファインメントによって透明性を獲得することが多い。</p>\n\n<p>開発チームは見積りに対して責任を持つ。プロダクトオーナーがトレードオフの理解や選択などについて開発チームに影響を及ぼすこともあるが、最終的な見積りは実際に作業をする人が行う。</p>\n\n<h4>\n<span id=\"811-ゴールへの進捗を追跡する\" class=\"fragment\"></span><a href=\"#811-%E3%82%B4%E3%83%BC%E3%83%AB%E3%81%B8%E3%81%AE%E9%80%B2%E6%8D%97%E3%82%92%E8%BF%BD%E8%B7%A1%E3%81%99%E3%82%8B\"><i class=\"fa fa-link\"></i></a>8.1.1 ゴールへの進捗を追跡する</h4>\n\n<p>いずれかの時点で、ゴールに対する残作業を合計する。プロダクトオーナーは、少なくともスプリントレビューにおいて、この残作業の合計を追跡する。プロダクトオーナーは、前回のスプリントレビュー時点の残作業の合計と比較して、希望する期日までにゴールに到達できるかどうかを評価する。この情報はステークホルダー全員に明らかにする。</p>\n\n<p>進捗の見通しを立てるために、バーンダウン、バーンアップ、累積フローなどのさまざまなプラクティスが使用されている。これらは有用ではあるが、経験主義の重要性を置き換えるものではない。複雑な環境下では、何が起きるかわからない。すでに発生したことだけが、これから先の意思決定に使用できる。</p>\n\n<h3>\n<span id=\"82-スプリントバックログ\" class=\"fragment\"></span><a href=\"#82-%E3%82%B9%E3%83%97%E3%83%AA%E3%83%B3%E3%83%88%E3%83%90%E3%83%83%E3%82%AF%E3%83%AD%E3%82%B0\"><i class=\"fa fa-link\"></i></a>8.2 スプリントバックログ</h3>\n\n<p>スプリントバックログは、スプリントで選択したプロダクトバックログアイテムと、それらのアイテムをプロダクトインクリメントにして届け、スプリントゴールを達成するための計画を合わせたものである。スプリントバックログは、次のインクリメントに含まれる機能と、その機能を「完成」したインクリメントにして届けるために必要な作業について、開発チームが予想したものである。</p>\n\n<p>スプリントバックログによって、開発チームがスプリントゴールを達成するのに必要な作業がすべて見える化されている。継続的改善を確実なものとするために、前回のレトロスペクティブで特定した優先順位の高いプロセスの改善策を少なくとも 1 つは含めておく。</p>\n\n<p>スプリントバックログは十分に詳細であり、今後も変更される可能性のある計画である。それはデイリースクラムで理解できる程度のものである。開発チームは、スプリントでスプリントバックログを修正する。スプリントバックログはスプリントで創発される。こうした創発が発生するのは、開発チームが計画を実行するなかで、スプリントゴールの達成に必要な作業を学習するからである。</p>\n\n<p>新しい作業が必要になれば、開発チームがスプリントバックログに作業を追加する。作業が完了すれば、残作業の見積りを更新する。計画の要素が不要になれば削除する。スプリントでスプリントバックログを変更できるのは開発チームだけである。スプリントバックログには、開発チームがスプリントで行う作業がリアルタイムに反映される。スプリントバックログは開発チームのものである。</p>\n\n<h4>\n<span id=\"821-スプリントの進捗を追跡する\" class=\"fragment\"></span><a href=\"#821-%E3%82%B9%E3%83%97%E3%83%AA%E3%83%B3%E3%83%88%E3%81%AE%E9%80%B2%E6%8D%97%E3%82%92%E8%BF%BD%E8%B7%A1%E3%81%99%E3%82%8B\"><i class=\"fa fa-link\"></i></a>8.2.1 スプリントの進捗を追跡する</h4>\n\n<p>スプリントのいずれかの時点で、スプリントバックログの残作業を合計する。開発チームは、少なくともデイリースクラムにおいて、この残作業の合計を追跡し、スプリントゴールの達成に見通しを立てる。開発チームはスプリントで残作業を追跡し、自分たちの進捗を管理する。</p>\n\n<h3>\n<span id=\"83-インクリメント\" class=\"fragment\"></span><a href=\"#83-%E3%82%A4%E3%83%B3%E3%82%AF%E3%83%AA%E3%83%A1%E3%83%B3%E3%83%88\"><i class=\"fa fa-link\"></i></a>8.3 インクリメント</h3>\n\n<p>インクリメントとは、これまでのインクリメントの価値と今回のスプリントで完成したプロダクトバックログアイテムを合わせたものである。スプリントの終了時には、新しいインクリメントが「完成」していなければいけない。つまり、インクリメントが動作する状態であり、スクラムチームの「完成」の定義に合っていることを意味する。インクリメントは、完成していて、検査可能なものであり、スプリントの終了時の経験主義を支援するものである。インクリメントは、ビジョンやゴールに向かうステップである。プロダクトオーナーがリリースを決定する／しないにかかわらず、インクリメントは常に動作する状態にしておかなければいけない。</p>\n\n<h2>\n<span id=\"9-作成物の透明性\" class=\"fragment\"></span><a href=\"#9-%E4%BD%9C%E6%88%90%E7%89%A9%E3%81%AE%E9%80%8F%E6%98%8E%E6%80%A7\"><i class=\"fa fa-link\"></i></a>9. 作成物の透明性</h2>\n\n<p>スクラムは透明性に依存している。作成物の状態を把握することで、価値の最適化やリスクの制御に関する決定を行う。透明性が確保されている限り、こうした決定には信頼できる根拠が存在する。作成物の透明性が不完全であれば、こうした決定には不備があり、価値は低減し、リスクが高まる可能性がある。</p>\n\n<p>スクラムマスターは、プロダクトオーナー、開発チーム、その他の関係者と一緒になって、作成物が完全に透明化されているかを理解する。不完全な透明性に対処するには、いくつかのプラクティスが存在する。スクラムマスターは、そのなかから最適なプラクティスを選択してもらえるように支援する。スクラムマスターは、作成物の検査、パターンの察知、言説の傾聴、期待値と実際値の違いを把握することで、不完全な透明性を検知できる。</p>\n\n<p>スクラムマスターの仕事は、スクラムチームや組織と一緒になって、作成物の透明性を向上させることである。この仕事には、学習・説得・変化を伴うことが多い。透明性は一夜にしてならず。透明性とは長い道のりなのである。</p>\n\n<h3>\n<span id=\"91-完成doneの定義\" class=\"fragment\"></span><a href=\"#91-%E5%AE%8C%E6%88%90done%E3%81%AE%E5%AE%9A%E7%BE%A9\"><i class=\"fa fa-link\"></i></a>9.1 「完成（Done）」の定義</h3>\n\n<p>プロダクトバックログアイテムやインクリメントの「完成」を決めるときには、全員がその「完成」の意味を理解しておかなければいけない。スクラムチームによってその意味は大きく異なるかもしれないが、作業の完了についてメンバーが共通の理解を持ち、透明性を確保しなければいけない。これは、スクラムチームの『「完成」の定義』と呼ばれ、プロダクトインクリメントの作業が完了したかどうかの評価に使われる。</p>\n\n<p>この定義は、開発チームがスプリントプランニングでプロダクトバックログアイテムをいくつ選択するかの指針にもなる。各スプリントの目的は、そのときの「完成」の定義に合ったリリース判断可能な機能のインクリメントを届けることである。</p>\n\n<p>開発チームは、スプリントごとにプロダクトインクリメントを届ける。インクリメントは実際に利用可能なものであり、プロダクトオーナーがすぐにリリースすることもできる。インクリメントの「完成」の定義に関して、開発組織の慣例・標準・ガイドラインが存在する場合は、スクラムチームは最低でもそれを守らなければいけない。</p>\n\n<p>インクリメントの「完成」の定義が開発組織に存在しない場合は、スクラムチームの開発チームはプロダクトに適した「完成」を定義しなければいけない。複数のスクラムチームがシステムやプロダクトのリリース作業をする場合は、すべてのスクラムチームの開発チームが共通の「完成」の定義を使用しなければいけない。</p>\n\n<p>インクリメントは、それまでのインクリメントに追加されたものであり、すべてが正常に動くように十分にテストされたものである。</p>\n\n<p>スクラムチームが成熟していくと、「完成」の定義にさらに厳しい品質条件を追加することもある。新しい定義を作り、それを使用していくと、以前に「完成」したインクリメントにも手を加えなければいけないことが明らかになる可能性がある。あらゆるプロダクトやシステムは「完成」の定義を備えるべきである。それがあらゆる作業の完了基準となる。</p>\n\n<h2>\n<span id=\"10-最後に\" class=\"fragment\"></span><a href=\"#10-%E6%9C%80%E5%BE%8C%E3%81%AB\"><i class=\"fa fa-link\"></i></a>10. 最後に</h2>\n\n<p>スクラムは無料であり、本ガイドで提供されるものである。スクラムの役割・イベント・作成物・ルールは不変である。スクラムの一部だけを導入することも可能だが、それはスクラムとは言えない。すべてをまとめたものがスクラムであり、その他の技法・方法論・プラクティスのコンテナとして機能する。</p>\n\n<h2>\n<span id=\"11-謝辞\" class=\"fragment\"></span><a href=\"#11-%E8%AC%9D%E8%BE%9E\"><i class=\"fa fa-link\"></i></a>11. 謝辞</h2>\n\n<h3>\n<span id=\"111-人々\" class=\"fragment\"></span><a href=\"#111-%E4%BA%BA%E3%80%85\"><i class=\"fa fa-link\"></i></a>11.1 人々</h3>\n\n<p>スクラムに貢献してくれた非常に多くの人たちのなかでも、最初に貢献してくれた人物の名前を挙</p>\n\n<p>げたい。まず、Jeff Sutherlandと一緒に働いたJeff McKennaとJohn Scumniotales。それから、KenSchwaberと一緒に働いたMike SmithとChris Martinと同僚たち。翌年からは、その他にも多くの人たちが貢献してくれた。彼らの助けがなければ、スクラムは今日のように洗練されていなかっただろう。</p>\n\n<h3>\n<span id=\"112-歴史\" class=\"fragment\"></span><a href=\"#112-%E6%AD%B4%E5%8F%B2\"><i class=\"fa fa-link\"></i></a>11.2 歴史</h3>\n\n<p>Ken SchwaberとJeff Sutherlandが 1995 年からスクラムに取り組み、 1995 年のOOPSLAカンファレンスにおいて、スクラムを共同発表した。この発表は、KenとJeffが過去数年間で学んだことを文書化したものであり、はじめて公開された正式なスクラムの定義である。</p>\n\n<p>スクラムの歴史は別のところで説明されている。最初の試行錯誤の場であるIndividual, Inc.、Newspage、Fidelity Investments、IDX（現 GE Medical）に感謝したい。</p>\n\n<p>スクラムガイドは、Jeff SutherlandとKen Schwaberが 20 年以上かけて開発・進化・保守してきたスクラムを文書化したものである。その他の情報源では、スクラムフレームワークを補完するパターン、プロセス、インサイトなどが提供されている。これらは、生産性、価値、創造性、結果に対する満足を高める可能性がある。</p>\n\n<h3>\n<span id=\"113-翻訳\" class=\"fragment\"></span><a href=\"#113-%E7%BF%BB%E8%A8%B3\"><i class=\"fa fa-link\"></i></a>11.3 翻訳</h3>\n\n<p>本ガイドは、Ken SchwaberとJeff Sutherlandによる英語バージョンを日本語に翻訳したものである。日本語訳は、角征典が担当した。最新版の翻訳は、守田憲司さん、高江洲睦さん、永瀬美穂さん、栗秋宏徳さん、川口恭伸さん、角谷信太郎さん、木村卓央さん、原田騎郎さん、吉羽龍太郎さんにご協力いただいた。以前の版では、むらはしけんいちさん、いろさん、たなべすなおさんにもご協力いただいた。</p>\n\n<p>翻訳に関する連絡先：角征典</p>\n\n<h2>\n<span id=\"12-スクラムガイド-2016-年版と-2017-年版の変更点\" class=\"fragment\"></span><a href=\"#12-%E3%82%B9%E3%82%AF%E3%83%A9%E3%83%A0%E3%82%AC%E3%82%A4%E3%83%89-2016-%E5%B9%B4%E7%89%88%E3%81%A8-2017-%E5%B9%B4%E7%89%88%E3%81%AE%E5%A4%89%E6%9B%B4%E7%82%B9\"><i class=\"fa fa-link\"></i></a>12. スクラムガイド 2016 年版と 2017 年版の変更点</h2>\n\n<h3>\n<span id=\"121-スクラムの用途のセクションを追加した\" class=\"fragment\"></span><a href=\"#121-%E3%82%B9%E3%82%AF%E3%83%A9%E3%83%A0%E3%81%AE%E7%94%A8%E9%80%94%E3%81%AE%E3%82%BB%E3%82%AF%E3%82%B7%E3%83%A7%E3%83%B3%E3%82%92%E8%BF%BD%E5%8A%A0%E3%81%97%E3%81%9F\"><i class=\"fa fa-link\"></i></a>12.1. 「スクラムの用途」のセクションを追加した。</h3>\n\n<p>当初、スクラムはプロダクトの開発と管理のために開発された。 1990 年代初頭から使用され、今では<br>\n以下のように世界中で広く利用されている。</p>\n\n<ol>\n<li>有望な市場・技術・プロダクトの研究および特定</li>\n<li>プロダクトや追加機能の開発</li>\n<li>プロダクトや追加機能のリリース（ 1 日に何度もリリースされる）</li>\n<li>プロダクトが使用するクラウド（オンライン、セキュア、オンデマンド）やその他運用環境の開発と保守</li>\n<li>プロダクトの保守や刷新</li>\n</ol>\n\n<p>スクラムは、ソフトウェア、ハードウェア、組込みソフトウェア、機能同士を接続するネットワーク、自動運転車などの開発から、学校、政府、マーケティング、組織運営マネジメントに至るまで、個人や社会が日常的に使用するあらゆるものに使用されている。技術・市場・環境の複雑化やそれらの相互作用は急速に高まっており、スクラムがその対応に有効であることは日々証明されている。</p>\n\n<p>スクラムは反復的で漸進的な知識移転において特に有効であることが示されている。今では、プロダクト、サービス、所属する組織の管理に広く利用されている。</p>\n\n<p>スクラムの本質は、少人数制のチームである。個々のチームは非常に柔軟で適応力に優れている。こうした強みは、単一のチームであっても、複数あるいは多数のチームであっても、数千人の成果やプロダクトを開発・リリース・運用・保守するネットワーク型のチームであっても有効である。チームは協力や情報交換をしながら、洗練された開発アーキテクチャやターゲットとするリリース環境を整えていく。</p>\n\n<p>スクラムガイドで「開発」や「開発する」といった言葉が登場するとき、それは上記のような複雑な作業を意味している。</p>\n\n<h3>\n<span id=\"122-スクラムマスターのセクションの表現を変更し役割を明確化した\" class=\"fragment\"></span><a href=\"#122-%E3%82%B9%E3%82%AF%E3%83%A9%E3%83%A0%E3%83%9E%E3%82%B9%E3%82%BF%E3%83%BC%E3%81%AE%E3%82%BB%E3%82%AF%E3%82%B7%E3%83%A7%E3%83%B3%E3%81%AE%E8%A1%A8%E7%8F%BE%E3%82%92%E5%A4%89%E6%9B%B4%E3%81%97%E5%BD%B9%E5%89%B2%E3%82%92%E6%98%8E%E7%A2%BA%E5%8C%96%E3%81%97%E3%81%9F\"><i class=\"fa fa-link\"></i></a>12.2. 「スクラムマスター」のセクションの表現を変更し、役割を明確化した。</h3>\n\n<p>スクラムマスターは、スクラムガイドで定義されたスクラムの促進と支援に責任を持つ。そのためにスクラムマスターは、スクラムの理論・プラクティス・ルール・価値基準を全員に理解してもらえるように支援する。</p>\n\n<p>スクラムマスターは、スクラムチームのサーバントリーダーである（訳注：メンバーが成果を上げるために支援や奉仕をするリーダーのこと）。 スクラムマスターは、スクラムチームとやり取りをするときに役に立つこと／立たないことをスクラムチームの外部の人たちに理解してもらう。スクラムマスターは、こうしたやり取りに変化をもたらすことで、スクラムチームの作る価値を最大化する。</p>\n\n<h3>\n<span id=\"123-スクラムマスターはプロダクトオーナーを支援するのセクションに以下を追加した\" class=\"fragment\"></span><a href=\"#123-%E3%82%B9%E3%82%AF%E3%83%A9%E3%83%A0%E3%83%9E%E3%82%B9%E3%82%BF%E3%83%BC%E3%81%AF%E3%83%97%E3%83%AD%E3%83%80%E3%82%AF%E3%83%88%E3%82%AA%E3%83%BC%E3%83%8A%E3%83%BC%E3%82%92%E6%94%AF%E6%8F%B4%E3%81%99%E3%82%8B%E3%81%AE%E3%82%BB%E3%82%AF%E3%82%B7%E3%83%A7%E3%83%B3%E3%81%AB%E4%BB%A5%E4%B8%8B%E3%82%92%E8%BF%BD%E5%8A%A0%E3%81%97%E3%81%9F\"><i class=\"fa fa-link\"></i></a>12.3. 「スクラムマスターはプロダクトオーナーを支援する」のセクションに以下を追加した。</h3>\n\n<p>スクラムチームの全員がゴール、スコープ、プロダクトのドメインを可能な限り理解できるようにする。</p>\n\n<h3>\n<span id=\"124-デイリースクラムのセクションの最初の段落を以下のように変更した\" class=\"fragment\"></span><a href=\"#124-%E3%83%87%E3%82%A4%E3%83%AA%E3%83%BC%E3%82%B9%E3%82%AF%E3%83%A9%E3%83%A0%E3%81%AE%E3%82%BB%E3%82%AF%E3%82%B7%E3%83%A7%E3%83%B3%E3%81%AE%E6%9C%80%E5%88%9D%E3%81%AE%E6%AE%B5%E8%90%BD%E3%82%92%E4%BB%A5%E4%B8%8B%E3%81%AE%E3%82%88%E3%81%86%E3%81%AB%E5%A4%89%E6%9B%B4%E3%81%97%E3%81%9F\"><i class=\"fa fa-link\"></i></a>12.4. 「デイリースクラム」のセクションの最初の段落を以下のように変更した。</h3>\n\n<p>デイリースクラムとは、開発チームのための 15 分間のタイムボックスのイベントである。スプリントでは、毎日デイリースクラムを開催する。開発チームは、次の 24 時間の作業を計画する。前回のデイリースクラムから行なった作業の検査と今後のスプリント作業の予想をすることで、チームのコラボレーションやパフォーマンスを最適化するのである。デイリースクラムは毎日、同じ時間・場所で開催し、複雑にならないようにする。</p>\n\n<h3>\n<span id=\"125-デイリースクラムのセクションを変更してデイリースクラムのゴールを明確化した\" class=\"fragment\"></span><a href=\"#125-%E3%83%87%E3%82%A4%E3%83%AA%E3%83%BC%E3%82%B9%E3%82%AF%E3%83%A9%E3%83%A0%E3%81%AE%E3%82%BB%E3%82%AF%E3%82%B7%E3%83%A7%E3%83%B3%E3%82%92%E5%A4%89%E6%9B%B4%E3%81%97%E3%81%A6%E3%83%87%E3%82%A4%E3%83%AA%E3%83%BC%E3%82%B9%E3%82%AF%E3%83%A9%E3%83%A0%E3%81%AE%E3%82%B4%E3%83%BC%E3%83%AB%E3%82%92%E6%98%8E%E7%A2%BA%E5%8C%96%E3%81%97%E3%81%9F\"><i class=\"fa fa-link\"></i></a>12.5. 「デイリースクラム」のセクションを変更して、デイリースクラムのゴールを明確化した。</h3>\n\n<p>デイリースクラムの構成は、開発チームが設定する。スプリントゴールを目指している限り、他のやり方で行なっても構わない。質問を使うチームもあれば、議論ベースで進めるチームもある。たとえば、以下のような例を使用するといいだろう。</p>\n\n<ul>\n<li>開発チームがスプリントゴールを達成するために、私が昨日やったことは何か？</li>\n<li>開発チームがスプリントゴールを達成するために、私が今日やることは何か？</li>\n<li>私や開発チームがスプリントゴールを達成する上で、障害となる物を目撃したか？</li>\n</ul>\n\n<h3>\n<span id=\"126-タイムボックスについて明確化した\" class=\"fragment\"></span><a href=\"#126-%E3%82%BF%E3%82%A4%E3%83%A0%E3%83%9C%E3%83%83%E3%82%AF%E3%82%B9%E3%81%AB%E3%81%A4%E3%81%84%E3%81%A6%E6%98%8E%E7%A2%BA%E5%8C%96%E3%81%97%E3%81%9F\"><i class=\"fa fa-link\"></i></a>12.6. タイムボックスについて明確化した。</h3>\n\n<p>「最大」という言葉を追加して、イベントを時間どおりに行なう必要があるのかという疑問を解消し、許容される最大の時間であることを明確にした。</p>\n\n<h3>\n<span id=\"127-スプリントバックログのセクションに以下を追加した\" class=\"fragment\"></span><a href=\"#127-%E3%82%B9%E3%83%97%E3%83%AA%E3%83%B3%E3%83%88%E3%83%90%E3%83%83%E3%82%AF%E3%83%AD%E3%82%B0%E3%81%AE%E3%82%BB%E3%82%AF%E3%82%B7%E3%83%A7%E3%83%B3%E3%81%AB%E4%BB%A5%E4%B8%8B%E3%82%92%E8%BF%BD%E5%8A%A0%E3%81%97%E3%81%9F\"><i class=\"fa fa-link\"></i></a>12.7. 「スプリントバックログ」のセクションに以下を追加した。</h3>\n\n<p>継続的改善を確実なものとするために、前回のレトロスペクティブで特定した優先順位の高いプロセスの改善策を少なくとも 1 つは含めておく。</p>\n\n<h3>\n<span id=\"128-インクリメントのセクションが明確になるように以下を追加した\" class=\"fragment\"></span><a href=\"#128-%E3%82%A4%E3%83%B3%E3%82%AF%E3%83%AA%E3%83%A1%E3%83%B3%E3%83%88%E3%81%AE%E3%82%BB%E3%82%AF%E3%82%B7%E3%83%A7%E3%83%B3%E3%81%8C%E6%98%8E%E7%A2%BA%E3%81%AB%E3%81%AA%E3%82%8B%E3%82%88%E3%81%86%E3%81%AB%E4%BB%A5%E4%B8%8B%E3%82%92%E8%BF%BD%E5%8A%A0%E3%81%97%E3%81%9F\"><i class=\"fa fa-link\"></i></a>12.8. 「インクリメント」のセクションが明確になるように以下を追加した。</h3>\n\n<p>インクリメントは、完成していて、検査可能なものであり、スプリントの終了時の経験主義を支援するものである。インクリメントは、ビジョンやゴールに向かうステップである。</p>\n","body":"## はじめに\n\nみなさんはスクラムガイド読んだことありますか？\n\n`弊社はスクラム導入している` `アジャイルいいよね！` とかいう会話をしたことが一度でもある人は、\nそんな長くないので原著スクラムガイドを読んでおくのはおすすめです。\n\n[PDF版](https://scrumguides.org/docs/scrumguide/v2017/2017-Scrum-Guide-Japanese.pdf)の文書を、クリエイティブ・コモンズ　[CC BY-SA 4.0](https://creativecommons.org/licenses/by-sa/4.0/deed.ja)　のライセンス下で再配布しています。内容に変更はありません。\n通勤中に何度も読んでいるときにPDFが大変だったなと思い、Webで見れるようにしたく書いてます。\n([2020年版はこっち](https://qiita.com/ykhirao/items/ed320eaecb876bfd189e))\n\n------\n\n# スクラムガイド™ 2017\n\n## 1. スクラムガイドの目的\nスクラムは、複雑なプロダクトを開発・提供・保守するためのフレームワークである。本ガイドでは、スクラムの定義を説明する。スクラムの定義に、スクラムの役割・イベント・作成物と、それらをまとめるルールが含まれる。スクラムは、Ken SchwaberとJeff Sutherlandが開発したものであり、スクラムガイドはこの 2 人が執筆・提供する。両者は共にスクラムガイドを支援している。\n\n## 2. スクラムの定義\nスクラム（名詞）：複雑で変化の激しい問題に対応するためのフレームワークであり、可能な限り価値の高いプロダクトを生産的かつ創造的に届けるためのものである。\n\nスクラムとは、以下のようなものである。\n\n* 軽量\n* 理解が容易\n* 習得は困難\n\nスクラムは、 1990 年代初頭から複雑なプロダクトの作業管理に使用されてきたプロセスフレームワークである。プロダクトを構築するプロセス、技法、決定的な方法論などではない。さまざまなプロセスや技法を取り入れることのできるフレームワークである。スクラムは、これまでのプロダクト管理や仕事のテクニックの相対的な有効性を明らかにして、プロダクト・チーム・作業環境の継続的な改善を可能にする。\n\nスクラムフレームワークは、スクラムチームとその役割・イベント・作成物・ルールで構成されている。それぞれに目的があり、スクラムの成功や利用に欠かせない。\n\nスクラムのルールは、役割・イベント・作成物をまとめ、それらの関係性や相互作用を統括するものである。スクラムのルールについては、本稿全体で説明する。\n\nスクラムフレームワークを使用する具体的な方法にはさまざまなものがあり、それらについては本稿では触れない。\n\n## 3. スクラムの用途\n\n当初、スクラムはプロダクトの開発と管理のために開発された。 1990 年代初頭から使用され、今では以下のように世界中で広く利用されている。\n\n1. 有望な市場・技術・プロダクトの研究および特定\n2. プロダクトや追加機能の開発\n3. プロダクトや追加機能のリリース（ 1 日に何度もリリースされる）\n4. プロダクトが使用するクラウド（オンライン、セキュア、オンデマンド）やその他運用環境の開発\nと保守\n5. プロダクトの保守や刷新\n\nスクラムは、ソフトウェア、ハードウェア、組込みソフトウェア、機能同士を接続するネットワーク、自動運転車などの開発から、学校、政府、マーケティング、組織運営マネジメントに至るまで、個人や社会が日常的に使用するあらゆるものに使用されている。\n\n技術・市場・環境の複雑化やそれらの相互作用は急速に高まっており、スクラムがその対応に有効であることは日々証明されている。\n\nスクラムは反復的で漸進的な知識移転において特に有効であることが示されている。今では、プロダクト、サービス、所属する組織の管理に広く利用されている。\n\nスクラムの本質は、少人数制のチームである。個々のチームは非常に柔軟で適応力に優れている。こうした強みは、単一のチームであっても、複数あるいは多数のチームであっても、数千人の成果やプロダクトを開発・リリース・運用・保守するネットワーク型のチームであっても有効である。チームは協力や情報交換をしながら、洗練された開発アーキテクチャやターゲットとするリリース環境を整えていく。\n\nスクラムガイドで「開発」や「開発する」といった言葉が登場するとき、それは上記のような複雑な作業を意味している。\n\n## 4. スクラムの理論\n\nスクラムは、経験的プロセス制御の理論（経験主義）を基本にしている。経験主義とは、実際の経験と既知に基づく判断によって知識が獲得できるというものである。スクラムでは、反復的かつ漸進的な手法を用いて、予測可能性の最適化とリスクの管理を行う。\n\n経験的プロセス制御の実現は、透明性・検査・適応の 3 本柱に支えられている。\n\n### 4.1 透明性\n\n経験的プロセスで重要なのは、結果責任を持つ者に対して見える化されていることである。透明性とは、こうしたことが標準化され、見ている人が共通理解を持つことである。\n\n例：\n\n* プロセスの用語を参加者全員で共有している。\n* 作業する人とそのインクリメントを検査する人が「完成」の定義を共有している。\n\n### 4.2 検査\n\nスクラムのユーザーは、スクラムの作成物やスプリントゴールの進捗を頻繁に検査し、好ましくない変化を検知する。ただし、頻繁にやりすぎて作業の妨げになってはいけない。スキルの高い検査担当者が念入りに行えば、検査は最大の効果をもたらす。\n\n### 4.3 適応\n\nプロセスの不備が許容値を超え、成果となるプロダクトを受け入れられないと検査担当者が判断した場合は、プロセスやその構成要素を調整する必要がある。調整はできるだけ早く行い、これ以上の逸脱を防がなければいけない。\n\nスクラムでは、検査と適応のための 4 つの公式なイベントを規定している。詳しくは、「スクラムイベント」の節で説明する。\n\n* スプリントプランニング\n* デイリースクラム\n* スプリントレビュー\n* スプリントレトロスペクティブ\n\n## 5. スクラムの価値基準\n\nスクラムチームが、確約（commitment）・勇気（courage）・集中（focus）・公開（openness）・尊敬（respect）の価値基準を取り入れ、それらを実践するとき、スクラムの柱（透明性・検査・適応）は現実のものとなり、あらゆる人に対する信頼が築かれる。スクラムチームのメンバーは、スクラムの役割・イベント・作成物に触れて仕事を進めるなかで、これらの価値基準を学習・探索する。\n\nスクラムを活用するには、これらの 5 つの価値基準を上手に実践しなければいけない。個人は、スクラムチームのゴールの達成を確約しなければいけない。スクラムチームのメンバーは、正しいことをする勇気を持ち、困難な問題に取り組まなければいけない。全員が、スプリントの作業とスクラムチームのゴールに集中しなければいけない。スクラムチームとステークホルダーは、すべての仕事とそれらを遂行する上での課題を公開することに合意しなければいけない。スクラムチームのメンバーは、お互いを能力のある独立した個人として尊敬しなければいけない。\n\n## 6. スクラムチーム\n\nスクラムチームは、プロダクトオーナー・開発チーム・スクラムマスターで構成される。スクラムチームは自己組織化されており、機能横断的である。自己組織化チームは、作業を成し遂げるための最善の策を、チーム外からの指示ではなく、自分たちで選択する。機能横断的チームは、チーム以外に頼らずに作業を成し遂げる能力を持っている。スクラムにおけるチームのモデルは、柔軟性・創造性・生産性を最適化するように設計されている。スクラムチームは、前述した用途や複雑な仕事において、非常に高い効果を自ら証明している。スクラムチームは、プロダクトを反復的・漸進的に届ける。これは、フィードバックの機会を最大化するためである。「完成」したプロダクトを漸進的に届けることで、動作するプロダクトで役に立つ可能性のあるバージョンを常に利用可能にする。\n\n### 6.1 プロダクトオーナー\n\nプロダクトオーナーは、開発チームから生み出されるプロダクトの価値の最大化に責任を持つ。組織・スクラムチーム・個人によって、その方法はさまざまである。プロダクトオーナーは、プロダクトバックログの管理に責任を持つ 1 人の人間である。プロダクトバックログの管理には、以下のようなものがある。\n\n* プロダクトバックログアイテムを明確に表現する。\n* ゴールとミッションを達成できるようにプロダクトバックログアイテムを並び替える。\n* 開発チームが行う作業の価値を最適化する。\n* プロダクトバックログを全員に見える化・透明化・明確化し、スクラムチームが次に行う作業を示す。\n* 必要とされるレベルでプロダクトバックログアイテムを開発チームに理解してもらう。\n\n上記の作業は、プロダクトオーナーが行う場合もあれば、開発チームが行う場合もある。いずれの場合も、最終的な責任はプロダクトオーナーが持つ。\n\nプロダクトオーナーは 1 人の人間であり、委員会ではない。委員会の要求をプロダクトバックログに反映することもあるだろうが、プロダクトバックログアイテムの優先順位の変更については、プロダクトオーナーと相談しなければいけない。\n\nプロダクトオーナーをうまく機能させるには、組織全体でプロダクトオーナーの決定を尊重しなければいけない。プロダクトオーナーの決定は、プロダクトバックログの内容や並び順という形で見える化されている。異なる要求の作業を開発チームに強制することは誰にもできない。\n\n### 6.2 開発チーム\n\n開発チームは、各スプリントの終了時にリリース判断可能な「完成」したプロダクトインクリメントを届けることのできる専門家で構成されている。「完成」したインクリメントは、スプリントレビューに必要である。インクリメントを作成できるのは、開発チームのメンバーだけである。\n\n開発チームは、自分たちの作業を構成・管理するために、組織から体制と権限を与えられている。その相乗効果によって、開発チーム全体の効率と効果が最適化される。\n\n開発チームには、以下のような特徴がある。\n\n* 自己組織化されている。プロダクトバックログをリリース判断可能な機能のインクリメントに変える方法は、誰も（スクラムマスターでさえも）教えてくれない。\n* 機能横断的である。インクリメントを作成するスキルをチームとしてすべて備えている。\n* ある人にしかできない作業があったとしても、スクラムにおける開発チームのメンバーに肩書きはない。\n* テスティング、アーキテクチャ、運用、ビジネス分析のような専門領域であっても、スクラムは開発チームのサブチームを認めていない。\n* 開発チームのメンバーに専門能力や専門分野があったとしても、最終的な責任は開発チーム全体が持つ。\n\n#### 6.2.1 開発チームの規模\n\n開発チームに最適な人数は、小回りが利く程度に少なく、 1 つのスプリントで重要な作業が成し遂げられる程度に多い人数である。開発チームのメンバーが 3 人未満の場合は、相互作用が少なく、生産性の向上につながらない。また、開発チームの規模が小さいと、スキル不足が原因でリリース判断可能なインクリメントを届けられない可能性もある。メンバーが 9 人を超えた場合は、調整の機会が多くなってしまう。また、チームの規模が大きいと経験的プロセスが複雑になり、有益ではなくなる。スプリントバックログの作業に携わらないのであれば、プロダクトオーナーとスクラムマスターはこの人数に含まない。\n\n\n### 6.3 スクラムマスター\n\nスクラムマスターは、スクラムガイドで定義されたスクラムの促進と支援に責任を持つ。スクラムマスターは、スクラムの理論・プラクティス・ルール・価値基準を全員に理解してもらえるように支援することで、その責任を果たす。\n\nスクラムマスターは、スクラムチームのサーバントリーダーである（訳注：メンバーが成果を上げるために支援や奉仕をするリーダーのこと）。 スクラムマスターは、スクラムチームとやり取りをするときに役に立つこと／立たないことをスクラムチームの外部の人たちに理解してもらう。スクラムマスターは、こうしたやり取りに変化をもたらすことで、スクラムチームの作る価値を最大化する。\n\n\n#### 6.3.1 スクラムマスターはプロダクトオーナーを支援する\n\nスクラムマスターは、さまざまな形でプロダクトオーナーを支援する。\n\n* スクラムチームの全員がゴール、スコープ、プロダクトのドメインを可能な限り理解できるようにする。\n* 効果的なプロダクトバックログの管理方法を探す。\n* 明確で簡潔なプロダクトバックログアイテムの必要性についてスクラムチームに理解してもらう。\n* 経験主義におけるプロダクトプランニングについて理解する。\n* 価値を最大化するためのプロダクトバックログの調整方法をプロダクトオーナーに把握してもらう。\n* アジャイルを理解・実践している。\n* 必要に応じてスクラムイベントをファシリテートする。\n\n#### 6.3.2 スクラムマスターは開発チームを支援する\n\nスクラムマスターは、さまざまな形で開発チームを支援する。\n\n* 自己組織化・機能横断的な開発チームをコーチする。\n* 開発チームが価値の高いプロダクトを作れるように支援する。\n* 開発チームの進捗を妨げるものを排除する。\n* 必要に応じてスクラムイベントをファシリテートする。\n* スクラムがまだ完全に適用・理解されていない組織環境で、開発チームをコーチする。\n\n#### 6.3.3 スクラムマスターは組織を支援する\n\nスクラムマスターは、さまざまな形で組織を支援する。\n\n* 組織へのスクラムの導入を指導・コーチする。\n* 組織へのスクラムの導入方法を計画する。\n* スクラムや経験的プロダクト開発を社員やステークホルダーに理解・実施してもらう。\n* スクラムチームの生産性を高めるような変化を促す。\n* 他のスクラムマスターと一緒に組織におけるスクラム導入の効果を高める。\n\n## 7. スクラムイベント\n\nスクラムで規定されたイベントは規則性を作り出し、スクラムで定義されていないミーティングの必要性を最小化する。すべてのイベントは、時間に上限のあるタイムボックス化されたイベントである。スプリントを開始すると、その期間は固定され、増減することはできない。スプリント以外のイベントについては、目的が達成されたときに終了することもある。これは、プロセスでムダなことをせずに、必要な分だけ時間を使うためである。\n\nスプリント以外のスクラムイベントは、何かを検査・適応するための公式な機会である（スプリントはその他のイベントの入れ物である）。これらのイベントは、非常に重要な透明性と検査の両方が実現できるように設計されている。これらのイベントがなければ、透明性は低下し、検査・適応の多くの機会を失う。\n\n### 7.1 スプリント\n\nスクラムの中心はスプリントである。これは、「完成」した、利用可能な、リリース判断可能なプロダクトインクリメントを作るための、 1 か月以下のタイムボックスである。開発中はスプリントの長さは常に一定である。スプリントが終了すると、すぐに新しいスプリントが開始される。\n\nスプリントは、スプリントプランニング・デイリースクラム・開発作業・スプリントレビュー・スプリントレトロスペクティブで構成される。\n\nスプリントでは、\n\n* スプリントゴールに悪影響を及ぼすような変更を加えない。\n* 品質目標を下げない。\n* 学習が進むにつれてスコープが明確化され、プロダクトオーナーと開発チームの交渉が必要になる可能性がある。\n\nスプリントは 1 か月以内のプロジェクトと考えることができる。プロジェクトと同様に、スプリントは何かを成し遂げるために使うものである。スプリントには、開発対象のゴール、開発のための設計や柔軟な計画、実際の作業、成果となるプロダクトインクリメントが含まれる。\n\nスプリントの期間は 1 か月以内に制限されている。スプリントが長すぎると、開発対象の定義が変更されたり、複雑になったり、リスクが増大したりする可能性がある。ゴールに対する進捗を少なくとも 1 か月ごとに検査・適応することで、予測可能性が高まるのである。また、リスクも 1 か月分のコストに収まるようになる。\n\n#### 7.1.1 スプリントの中止\n\nスプリントはタイムボックスの終了前に中止できる。スプリントを中止する権限があるのは、プロダクトオーナーだけである。このときに、ステークホルダー・開発チーム・スクラムマスターの意見を参考にすることもできる。\n\nスプリントゴールが古くなった場合は、スプリントを中止することになるだろう。会社の方向性や市場・技術の状況が変化すると、スプリントゴールは古くなってしまう。状況を考慮して意味がなくなったと思えば、スプリントを中止すべきである。ただし、スプリントの期間は短いので、中止したからといって影響があることはほとんどない。\n\nスプリントを中止した場合は、プロダクトバックログの「完成」したアイテムをレビューする。部分的にリリース判断可能なものについては、通常はプロダクトオーナーが受け入れる。未完成のプロダクトバックログアイテムは、再見積りをしてからプロダクトバックログに戻す。そこにかかった作業の価値は急速に低下するため、頻繁に再見積りが必要になる（訳注：作りかけの機能や設計については、時間が経つと状況が変わってしまうため、その価値が失われてしまうことが多い。そうすると、最初から見積りをやり直す必要が出てくる）。\n\nスプリントを中止すると、新しいスプリントのスプリントプランニングのために全員が再度集まる必要があり、リソースを消費してしまう。また、スプリントの中止がチームのトラウマになってしまうこともある。とはいえ、スプリントの中止はめったに発生しない。\n\n### 7.2 スプリントプランニング\n\nスプリントの作業はスプリントプランニングで計画する。これはスクラムチームの共同作業である。\n\nスプリントが 1 か月の場合、スプリントプランニングのタイムボックスは最大で 8 時間である。スプリントの期間が短ければ、スプリントプランニングの時間も短くすることが多い。スクラムマスターは、参加者に目的を理解してもらうようにする。スクラムマスターは、スクラムチームにタイムボックスを守るように伝える。\n\nスプリントプランニングでは、以下の質問に答える。\n\n* スプリントの成果であるインクリメントで何を届けることができるか？\n* インクリメントを届けるために必要な作業をどのように成し遂げるか？\n\n##### トピック 1 ：スプリントで何ができるか？\n\n開発チームは、スプリントで開発できそうな機能を予想する。プロダクトオーナーは、スプリントで達成すべき目的と、完成すればスプリントゴールを達成できそうなプロダクトバックログアイテムについて検討する。スクラムチームはみんなで協力して、スプリントの作業を理解する。\n\nスプリントプランニングのインプットは、プロダクトバックログ、最新のプロダクトインクリメント、開発チームが予想するキャパシティと過去の実績である。プロダクトバックログから選択するアイテム数については、開発チームが責任を持つ。スプリントで何を達成するかを評価できるのは、開発チームだけである。\n\n\nスプリントプランニングでは、スクラムチームがスプリントゴールを設定する。スプリントゴールとは、プロダクトバックログを実装することで実現するスプリントの目的であり、開発チームがインクリメントを開発する指針となるものである。\n\n\n##### トピック 2 ：選択した作業をどのように成し遂げるか？\n\nプロダクトバックログアイテムを選択し、スプリントゴールを設定したら、開発チームはスプリントでそれらの機能を「完成」したプロダクトインクリメントにする方法を決める。選択したプロダクトバックログアイテムとそれらを届ける計画を合わせて、スプリントバックログと呼ぶ。\n\n開発チームは、プロダクトバックログを動作するプロダクトインクリメントに変えるために必要なシステムと作業の設計から着手する。作業の規模や工数はバラバラであっても構わないが、開発チームが次のスプリントで実現できそうなものを計画する。開発チームがスプリントの最初の数日間で行う作業については、スプリントプランニングで作業に分解する。作業の単位は 1 日以下にすることが多い。開発チームは自己組織化して、スプリントバックログの作業を引き受ける。これはスプリントプランニングだけでなく、必要であればスプリントでも行う。\n\n\nプロダクトオーナーは、選択したプロダクトバックログアイテムの明確化やトレードオフを支援する。開発チームの作業が多すぎたり少なすぎたりした場合は、選択されたプロダクトバックログアイテムについて、開発チームとプロダクトオーナーで話し合う。あるいは、技術やドメインに詳しい人を招待してアドバイスを求めることもできる。\n\n\nスプリントプランニングが終了するまでに、開発チームは自己組織化したチームとして、どのようにスプリントゴールを達成し、どのように期待されるインクリメントを作成するかをプロダクトオーナーとスクラムマスターに説明できなければいけない。\n\n#### 7.2.1 スプリントゴール\n\nスプリントゴールはスプリントの目的の集合であり、プロダクトバックログの実装によって実現するものである。これは開発チームがインクリメントを構築する理由を知る指針となる。スプリントゴールはスプリントプランニングで作成する。スプリントゴールを設定することで、開発チームがスプリント終了までに実装する機能を柔軟にできる。選択したプロダクトバックログアイテムは、一貫性のある機能として届けられる。それがスプリントゴールになることもある。スプリントゴールがあれば、開発チームは一致団結して作業ができる。\n\n\n開発チームが作業するときには、スプリントゴールを念頭に置く。スプリントゴールを達成するために、機能や技術を実装する。開発チームの予想と異なることが判明した場合は、プロダクトオーナーと交渉してスプリントバックログのスコープを調整する。\n\n### 7.3 デイリースクラム\n\nデイリースクラムとは、開発チームのための 15 分間のタイムボックスのイベントである。スプリントでは、毎日デイリースクラムを開催する。開発チームは、次の 24 時間の作業を計画する。前回のデイリースクラムから行なった作業の検査と今後のスプリント作業の予想をすることで、チームのコラボレーションやパフォーマンスを最適化するのである。デイリースクラムは毎日、同じ時間・場所で開催し、複雑にならないようにする。\n\n開発チームはデイリースクラムを使って、スプリントゴールとスプリントバックログの進捗を検査する。デイリースクラムは、開発チームがスプリントゴールを達成する可能性を最適化する。開発チームは、自己組織化チームとしてスプリントゴールを達成し、スプリント終了までに期待されるインクリメントを作成できるかを毎日把握しなければいけない。\n\nデイリースクラムの構成は、開発チームが設定する。スプリントゴールを目指している限り、他のやり方で行なっても構わない。質問を使うチームもあれば、議論ベースで進めるチームもある。たとえば、以下のような例を使用するといいだろう。\n\n* 開発チームがスプリントゴールを達成するために、私が昨日やったことは何か？\n* 開発チームがスプリントゴールを達成するために、私が今日やることは何か？\n* 私や開発チームがスプリントゴールを達成する上で、障害となる物を目撃したか？\n\n開発チームやチームメンバーは、デイリースクラムの終了直後に集まり、スプリントの残作業について、詳細な議論・適応・再計画を行うこともある。\n\n\nスクラムマスターは、開発チームにデイリースクラムを開催してもらうようにする。ただし、デイリースクラムを開催する責任は開発チームにある。スクラムマスターは、デイリースクラムを 15 分間のタイムボックスで終わらせるように開発チームに伝える。\n\nデイリースクラムは開発チームのためのミーティングである。それ以外の人たちが参加する場合、開発チームの邪魔にならないようにスクラムマスターが配慮する。\n\nデイリースクラムは、コミュニケーションを改善し、その他のミーティングを取り除き、開発の障害物を特定・排除し、迅速な意思決定を強調・助長して、開発チームのプロジェクト知識のレベルを向上させるものである。これは、検査と適応の重要なイベントである。\n\n\n### 7.4 スプリントレビュー\n\n\nスプリントレビューとは、スプリントの終了時にインクリメントの検査と、必要であればプロダクトバックログの適応を行うものである。スプリントレビューでは、スクラムチームとステークホルダーがスプリントの成果をレビューする。スプリントの成果とプロダクトバックログの変更を参考にして、価値を最適化するために次に何ができるかを参加者全員で話し合う。これはステータスミーティングではなく、略式のミーティングである。インクリメントを提示することで、フィードバックや協力を引き出すことを目的とする。\n\n\nスプリントが 1 か月の場合、スプリントレビューは最大 4 時間である。スプリントの期間が短ければ、スプリントレビューの時間も短くすることが多い。スクラムマスターはスプリントレビューが確実に開催されるようにして、参加者には目的を理解してもらうようにする。スクラムマスターは関係者全員にタイムボックスを守るように伝える。\n\nスプリントレビューには、以下の要素が含まれる。\n\n* 参加者は、スクラムチームと、プロダクトオーナーが招待した重要なステークホルダーである。\n* プロダクトオーナーは、プロダクトバックログアイテムの「完成」したものと「完成」していないものについて説明する。\n* 開発チームは、スプリントでうまくいったこと、直面した問題点、それをどのように解決したかを議論する。\n* 開発チームは、「完成」したものをデモして、インクリメントに対する質問に答える。「完成」の定義にプロダクト機能のリリースが含まれていれば、それらを表示してレビューしてもらう。\n* プロダクトオーナーは、現在のプロダクトバックログの状況を説明する。（必要であれば）現在の進捗から、可能性のある目標とデリバリーの日程を予測する。\n* グループ全体で次に何をするべきかを議論し、次のスプリントプランニングに価値のあるインプットを提供できるようにする。\n* 市場やプロダクトの利用状況によって、次に行うべき最も価値の高いことが変更される可能性をレビューする。\n* 次にリリースするプロダクトの機能や性能のスケジュール・予算・可能性・市場をレビューする。\n\n\nスプリントレビューの成果は、次のスプリントで使用するプロダクトバックログアイテムが含まれた改訂版のプロダクトバックログである。新たな機会に見合うように、プロダクトバックログを全体的に調整することもある。\n\n\n### 7.5 スプリントレトロスペクティブ\n\nスプリントレトロスペクティブは、スクラムチームの検査と次のスプリントの改善計画を作成する機会である。\n\nスプリントレトロスペクティブは、スプリントレビューが終わって、次のスプリントプランニングが始まる前に行う。スプリントが 1 か月の場合、スプリントレトロスペクティブは最大 3 時間である。スプリントの期間が短ければ、スプリントレトロスペクティブの時間も短くすることが多い。スクラムマスターは、このイベントが確実に開催されるようにする。また、参加者に目的を理解してもらうようにする。\n\nスクラムマスターは、このミーティングがポジティブで生産的になるようにする。スクラムマスターは、全員にタイムボックスを守るように伝える。スクラムマスターは、スクラムのプロセスを説明するために、チームメンバーとして参加する。\n\nスプリントレトロスペクティブには、以下の目的がある。\n\n* 人・関係・プロセス・ツールの観点から今回のスプリントを検査する。\n* うまくいった項目や今後の改善が必要な項目を特定・整理する。\n* スクラムチームの作業の改善実施計画を作成する。\n\nスクラムマスターは、次のスプリントが効果的で楽しいものになるように、スクラムチームにスクラムプロセスフレームワークの範囲内で開発プロセスやプラクティスを改善してもらう。スプリントレトロスペクティブにおいてスクラムチームは、作業プロセスの改善や「完成」の定義を調整することにより、プロダクトの品質を向上させる方法を計画する。ただし、プロダクトや組織の基準と衝突しないように適切に行う。\n\nスプリントレトロスペクティブが終わるまでに、スクラムチームは次のスプリントで実施する改善策を特定しなければいけない。これらの改善策の実施は、スクラムチーム自体の検査に対する適応になる。改善はいつでも実施可能だが、スプリントレトロスペクティブは検査と適応に集中するための公式な機会である。\n\n## 8. スクラムの作成物\n\nスクラムの作成物は、作業や価値を表したものであり、透明性や検査・適応の機会を提供するものである。スクラムで定義された作成物は、全員が共通理解を得るために必要な情報の透明性を最大化するように設計されている。\n\n### 8.1 プロダクトバックログ\n\nプロダクトバックログは、プロダクトに必要だと把握しているものをすべて順番に並べた一覧である。プロダクトに対する変更要求の唯一の情報源である。プロダクトオーナーは、プロダクトバックログの内容・可用性・並び順に責任を持つ。\n\nプロダクトバックログは決して完成しない。構築の初期段階には、明確でよく理解できている要求が並べられている。その後、プロダクトや使用環境に合わせて進化する。プロダクトバックログは動的であり、適切で競争力のある有用なプロダクトに必要なものを求めて絶えず変化する。プロダクトが存在する限り、プロダクトバックログも存在し続けるのである。\n\n\nプロダクトバックログは、今後のリリースで実装するプロダクトのフィーチャ・機能・要求・要望・修正をすべて一覧にしている。プロダクトバックログアイテムには、詳細・並び順・見積り・価値の属性がある。プロダクトバックログアイテムには、「完成」時にそれを確認するためのテスト記述も含まれていることが多い。\n\n\nプロダクトが使用されて価値が増加し、市場からフィードバックを得られると、プロダクトバックログは巨大で包括的な一覧になる。要求の変更は止まらない。プロダクトバックログは生きた作成物である。ビジネス要求、市場の状態、技術の変化などが、プロダクトバックログの変化につながる。\n\n\n複数のスクラムチームが同じプロダクトの作業をすることがよくある。そうした場合、プロダクトの作業は 1 つのプロダクトバックログに記述する。また、アイテムを分類するための属性をプロダクトバックログに追加することもある。\n\n\nプロダクトバックログに含まれるアイテムに対して、詳細の追加、見積り、並び替えをすることを、プロダクトバックログのリファインメントと呼ぶ。これはプロダクトオーナーと開発チームが協力して行う継続的なプロセスである。プロダクトバックログのリファインメントによって、アイテムのレビューと改訂が行われる。いつどのようにリファインメントをするかは、スクラムチームが決定する。リファインメントは、開発チームの作業の10%以下にすることが多い。ただし、プロダクトバックログアイテムはプロダクトオーナーの判断によって、いつでも更新できる。\n\n\n並び順が上のプロダクトバックログアイテムほど明確で詳細である。明確で詳細であれば、見積りも正確になる。並び順が下のアイテムほど不正確で詳細ではない。今後のスプリントで開発チームが従事するプロダクトバックログアイテムは、スプリントのタイムボックスで「完成」できるようにうまく細分化する。開発チームが 1 つのスプリントで「完成」できそうなプロダクトバックログアイテムは、スプリントプランニングで選択できる「準備完了（Ready）」の状態になったと見なすことができる。プロダクトバックログアイテムは、上記のリファインメントによって透明性を獲得することが多い。\n\n\n開発チームは見積りに対して責任を持つ。プロダクトオーナーがトレードオフの理解や選択などについて開発チームに影響を及ぼすこともあるが、最終的な見積りは実際に作業をする人が行う。\n\n#### 8.1.1 ゴールへの進捗を追跡する\n\nいずれかの時点で、ゴールに対する残作業を合計する。プロダクトオーナーは、少なくともスプリントレビューにおいて、この残作業の合計を追跡する。プロダクトオーナーは、前回のスプリントレビュー時点の残作業の合計と比較して、希望する期日までにゴールに到達できるかどうかを評価する。この情報はステークホルダー全員に明らかにする。\n\n進捗の見通しを立てるために、バーンダウン、バーンアップ、累積フローなどのさまざまなプラクティスが使用されている。これらは有用ではあるが、経験主義の重要性を置き換えるものではない。複雑な環境下では、何が起きるかわからない。すでに発生したことだけが、これから先の意思決定に使用できる。\n\n\n### 8.2 スプリントバックログ\n\n\nスプリントバックログは、スプリントで選択したプロダクトバックログアイテムと、それらのアイテムをプロダクトインクリメントにして届け、スプリントゴールを達成するための計画を合わせたものである。スプリントバックログは、次のインクリメントに含まれる機能と、その機能を「完成」したインクリメントにして届けるために必要な作業について、開発チームが予想したものである。\n\nスプリントバックログによって、開発チームがスプリントゴールを達成するのに必要な作業がすべて見える化されている。継続的改善を確実なものとするために、前回のレトロスペクティブで特定した優先順位の高いプロセスの改善策を少なくとも 1 つは含めておく。\n\nスプリントバックログは十分に詳細であり、今後も変更される可能性のある計画である。それはデイリースクラムで理解できる程度のものである。開発チームは、スプリントでスプリントバックログを修正する。スプリントバックログはスプリントで創発される。こうした創発が発生するのは、開発チームが計画を実行するなかで、スプリントゴールの達成に必要な作業を学習するからである。\n\n新しい作業が必要になれば、開発チームがスプリントバックログに作業を追加する。作業が完了すれば、残作業の見積りを更新する。計画の要素が不要になれば削除する。スプリントでスプリントバックログを変更できるのは開発チームだけである。スプリントバックログには、開発チームがスプリントで行う作業がリアルタイムに反映される。スプリントバックログは開発チームのものである。\n\n#### 8.2.1 スプリントの進捗を追跡する\n\nスプリントのいずれかの時点で、スプリントバックログの残作業を合計する。開発チームは、少なくともデイリースクラムにおいて、この残作業の合計を追跡し、スプリントゴールの達成に見通しを立てる。開発チームはスプリントで残作業を追跡し、自分たちの進捗を管理する。\n\n### 8.3 インクリメント\n\nインクリメントとは、これまでのインクリメントの価値と今回のスプリントで完成したプロダクトバックログアイテムを合わせたものである。スプリントの終了時には、新しいインクリメントが「完成」していなければいけない。つまり、インクリメントが動作する状態であり、スクラムチームの「完成」の定義に合っていることを意味する。インクリメントは、完成していて、検査可能なものであり、スプリントの終了時の経験主義を支援するものである。インクリメントは、ビジョンやゴールに向かうステップである。プロダクトオーナーがリリースを決定する／しないにかかわらず、インクリメントは常に動作する状態にしておかなければいけない。\n\n\n## 9. 作成物の透明性\n\nスクラムは透明性に依存している。作成物の状態を把握することで、価値の最適化やリスクの制御に関する決定を行う。透明性が確保されている限り、こうした決定には信頼できる根拠が存在する。作成物の透明性が不完全であれば、こうした決定には不備があり、価値は低減し、リスクが高まる可能性がある。\n\nスクラムマスターは、プロダクトオーナー、開発チーム、その他の関係者と一緒になって、作成物が完全に透明化されているかを理解する。不完全な透明性に対処するには、いくつかのプラクティスが存在する。スクラムマスターは、そのなかから最適なプラクティスを選択してもらえるように支援する。スクラムマスターは、作成物の検査、パターンの察知、言説の傾聴、期待値と実際値の違いを把握することで、不完全な透明性を検知できる。\n\nスクラムマスターの仕事は、スクラムチームや組織と一緒になって、作成物の透明性を向上させることである。この仕事には、学習・説得・変化を伴うことが多い。透明性は一夜にしてならず。透明性とは長い道のりなのである。\n\n\n### 9.1 「完成（Done）」の定義\n\nプロダクトバックログアイテムやインクリメントの「完成」を決めるときには、全員がその「完成」の意味を理解しておかなければいけない。スクラムチームによってその意味は大きく異なるかもしれないが、作業の完了についてメンバーが共通の理解を持ち、透明性を確保しなければいけない。これは、スクラムチームの『「完成」の定義』と呼ばれ、プロダクトインクリメントの作業が完了したかどうかの評価に使われる。\n\nこの定義は、開発チームがスプリントプランニングでプロダクトバックログアイテムをいくつ選択するかの指針にもなる。各スプリントの目的は、そのときの「完成」の定義に合ったリリース判断可能な機能のインクリメントを届けることである。\n\n開発チームは、スプリントごとにプロダクトインクリメントを届ける。インクリメントは実際に利用可能なものであり、プロダクトオーナーがすぐにリリースすることもできる。インクリメントの「完成」の定義に関して、開発組織の慣例・標準・ガイドラインが存在する場合は、スクラムチームは最低でもそれを守らなければいけない。\n\nインクリメントの「完成」の定義が開発組織に存在しない場合は、スクラムチームの開発チームはプロダクトに適した「完成」を定義しなければいけない。複数のスクラムチームがシステムやプロダクトのリリース作業をする場合は、すべてのスクラムチームの開発チームが共通の「完成」の定義を使用しなければいけない。\n\nインクリメントは、それまでのインクリメントに追加されたものであり、すべてが正常に動くように十分にテストされたものである。\n\nスクラムチームが成熟していくと、「完成」の定義にさらに厳しい品質条件を追加することもある。新しい定義を作り、それを使用していくと、以前に「完成」したインクリメントにも手を加えなければいけないことが明らかになる可能性がある。あらゆるプロダクトやシステムは「完成」の定義を備えるべきである。それがあらゆる作業の完了基準となる。\n\n\n## 10. 最後に\n\n\nスクラムは無料であり、本ガイドで提供されるものである。スクラムの役割・イベント・作成物・ルールは不変である。スクラムの一部だけを導入することも可能だが、それはスクラムとは言えない。すべてをまとめたものがスクラムであり、その他の技法・方法論・プラクティスのコンテナとして機能する。\n\n## 11. 謝辞\n\n### 11.1 人々\n\nスクラムに貢献してくれた非常に多くの人たちのなかでも、最初に貢献してくれた人物の名前を挙\n\nげたい。まず、Jeff Sutherlandと一緒に働いたJeff McKennaとJohn Scumniotales。それから、KenSchwaberと一緒に働いたMike SmithとChris Martinと同僚たち。翌年からは、その他にも多くの人たちが貢献してくれた。彼らの助けがなければ、スクラムは今日のように洗練されていなかっただろう。\n\n\n### 11.2 歴史\n\nKen SchwaberとJeff Sutherlandが 1995 年からスクラムに取り組み、 1995 年のOOPSLAカンファレンスにおいて、スクラムを共同発表した。この発表は、KenとJeffが過去数年間で学んだことを文書化したものであり、はじめて公開された正式なスクラムの定義である。\n\nスクラムの歴史は別のところで説明されている。最初の試行錯誤の場であるIndividual, Inc.、Newspage、Fidelity Investments、IDX（現 GE Medical）に感謝したい。\n\nスクラムガイドは、Jeff SutherlandとKen Schwaberが 20 年以上かけて開発・進化・保守してきたスクラムを文書化したものである。その他の情報源では、スクラムフレームワークを補完するパターン、プロセス、インサイトなどが提供されている。これらは、生産性、価値、創造性、結果に対する満足を高める可能性がある。\n\n\n### 11.3 翻訳\n\n\n本ガイドは、Ken SchwaberとJeff Sutherlandによる英語バージョンを日本語に翻訳したものである。日本語訳は、角征典が担当した。最新版の翻訳は、守田憲司さん、高江洲睦さん、永瀬美穂さん、栗秋宏徳さん、川口恭伸さん、角谷信太郎さん、木村卓央さん、原田騎郎さん、吉羽龍太郎さんにご協力いただいた。以前の版では、むらはしけんいちさん、いろさん、たなべすなおさんにもご協力いただいた。\n\n翻訳に関する連絡先：角征典\n\n## 12. スクラムガイド 2016 年版と 2017 年版の変更点\n\n### 12.1. 「スクラムの用途」のセクションを追加した。\n\n当初、スクラムはプロダクトの開発と管理のために開発された。 1990 年代初頭から使用され、今では\n以下のように世界中で広く利用されている。\n\n1. 有望な市場・技術・プロダクトの研究および特定\n2. プロダクトや追加機能の開発\n3. プロダクトや追加機能のリリース（ 1 日に何度もリリースされる）\n4. プロダクトが使用するクラウド（オンライン、セキュア、オンデマンド）やその他運用環境の開発と保守\n5. プロダクトの保守や刷新\n\nスクラムは、ソフトウェア、ハードウェア、組込みソフトウェア、機能同士を接続するネットワーク、自動運転車などの開発から、学校、政府、マーケティング、組織運営マネジメントに至るまで、個人や社会が日常的に使用するあらゆるものに使用されている。技術・市場・環境の複雑化やそれらの相互作用は急速に高まっており、スクラムがその対応に有効であることは日々証明されている。\n\nスクラムは反復的で漸進的な知識移転において特に有効であることが示されている。今では、プロダクト、サービス、所属する組織の管理に広く利用されている。\n\nスクラムの本質は、少人数制のチームである。個々のチームは非常に柔軟で適応力に優れている。こうした強みは、単一のチームであっても、複数あるいは多数のチームであっても、数千人の成果やプロダクトを開発・リリース・運用・保守するネットワーク型のチームであっても有効である。チームは協力や情報交換をしながら、洗練された開発アーキテクチャやターゲットとするリリース環境を整えていく。\n\nスクラムガイドで「開発」や「開発する」といった言葉が登場するとき、それは上記のような複雑な作業を意味している。\n\n### 12.2. 「スクラムマスター」のセクションの表現を変更し、役割を明確化した。\n\nスクラムマスターは、スクラムガイドで定義されたスクラムの促進と支援に責任を持つ。そのためにスクラムマスターは、スクラムの理論・プラクティス・ルール・価値基準を全員に理解してもらえるように支援する。\n\nスクラムマスターは、スクラムチームのサーバントリーダーである（訳注：メンバーが成果を上げるために支援や奉仕をするリーダーのこと）。 スクラムマスターは、スクラムチームとやり取りをするときに役に立つこと／立たないことをスクラムチームの外部の人たちに理解してもらう。スクラムマスターは、こうしたやり取りに変化をもたらすことで、スクラムチームの作る価値を最大化する。\n\n### 12.3. 「スクラムマスターはプロダクトオーナーを支援する」のセクションに以下を追加した。\n\nスクラムチームの全員がゴール、スコープ、プロダクトのドメインを可能な限り理解できるようにする。\n\n### 12.4. 「デイリースクラム」のセクションの最初の段落を以下のように変更した。\n\nデイリースクラムとは、開発チームのための 15 分間のタイムボックスのイベントである。スプリントでは、毎日デイリースクラムを開催する。開発チームは、次の 24 時間の作業を計画する。前回のデイリースクラムから行なった作業の検査と今後のスプリント作業の予想をすることで、チームのコラボレーションやパフォーマンスを最適化するのである。デイリースクラムは毎日、同じ時間・場所で開催し、複雑にならないようにする。\n\n### 12.5. 「デイリースクラム」のセクションを変更して、デイリースクラムのゴールを明確化した。\n\nデイリースクラムの構成は、開発チームが設定する。スプリントゴールを目指している限り、他のやり方で行なっても構わない。質問を使うチームもあれば、議論ベースで進めるチームもある。たとえば、以下のような例を使用するといいだろう。\n\n* 開発チームがスプリントゴールを達成するために、私が昨日やったことは何か？\n* 開発チームがスプリントゴールを達成するために、私が今日やることは何か？\n* 私や開発チームがスプリントゴールを達成する上で、障害となる物を目撃したか？\n\n### 12.6. タイムボックスについて明確化した。\n\n「最大」という言葉を追加して、イベントを時間どおりに行なう必要があるのかという疑問を解消し、許容される最大の時間であることを明確にした。\n\n\n### 12.7. 「スプリントバックログ」のセクションに以下を追加した。\n\n継続的改善を確実なものとするために、前回のレトロスペクティブで特定した優先順位の高いプロセスの改善策を少なくとも 1 つは含めておく。\n\n### 12.8. 「インクリメント」のセクションが明確になるように以下を追加した。\n\nインクリメントは、完成していて、検査可能なものであり、スプリントの終了時の経験主義を支援するものである。インクリメントは、ビジョンやゴールに向かうステップである。\n\n\n","coediting":false,"comments_count":0,"created_at":"2021-10-06T20:02:49+09:00","group":null,"id":"421dd8681671ada1f55a","likes_count":2,"private":false,"reactions_count":0,"tags":[{"name":"アジャイル","versions":[]},{"name":"devops","versions":[]},{"name":"スクラム","versions":[]},{"name":"スクラムマスター","versions":[]}],"title":"【Web版】スクラムガイド™ 2017","updated_at":"2021-10-13T17:37:37+09:00","url":"https://qiita.com/ykhirao/items/421dd8681671ada1f55a","user":{"description":"Web Developer For 6 years.\r\nPHP/Laravel && (React OR Vue.js)\r\nTypeScript/node.js\r\n\r\n業務委託の依頼とかはWantedlyとかからでお願いします！","facebook_id":"","followees_count":38,"followers_count":95,"github_login_name":"ykhirao","id":"ykhirao","items_count":60,"linkedin_id":"","location":"Tokyo, Japan","name":"yk","organization":"","permanent_id":112929,"profile_image_url":"https://qiita-image-store.s3.ap-northeast-1.amazonaws.com/0/112929/profile-images/1639030792","team_only":false,"twitter_screen_name":"yk_hirao","website_url":"https://www.wantedly.com/id/ykhirao"},"page_views_count":null,"team_membership":null}},"path":"posts/421dd8681671ada1f55a"}
